{"Look Back":"मागे बघ","Look Up":"वर बघ","Look Forward":"पुढे पाहा","What are you thankful for this week?":"या आठवड्यासाठी आपण काय आभारी आहात?","What are you struggling with and how can we help?":"आपण कशाशी संघर्ष करीत आहात आणि आम्ही कशी मदत करू शकतो?","How did you put into practice the scripture\/story we studied last time we met?":"आम्ही गेल्या वेळी भेटलेल्या पवित्र शास्त्र\/कथेचा अभ्यास कसा केला?","Who did you share last week's lesson with and how did it go?":"गेल्या आठवड्यातील धडा आपण कोणाबरोबर सामायिक केला आणि तो कसा गेला?","What needs did you meet in the community last week?":"गेल्या आठवड्यात आपण समाजात कोणत्या गरजा पूर्ण केल्या?","Ask someone to read the passage one paragraph at a time.":"एखाद्याला एका वेळी एक परिच्छेद वाचण्यास सांगा.","Have a group member tell it in their own words.":"एखाद्या गटाच्या सदस्याने ते त्यांच्या स्वत: च्या शब्दात सांगा.","Ask the group if they added anything or left anything out.":"ग्रुपला काही जोडल्यास किंवा काही सोडले असल्यास विचारा.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"जेव्हा आपण सर्व परिच्छेदांसह समाप्त करता तेव्हा गटातील एखाद्यास मेमरीद्वारे संपूर्ण कथा सांगण्यास सांगा. गटात कोणतीही त्रुटी दुरुस्त करा.","What does this passage tell us about God?":"हा रस्ता आपल्याला देवाबद्दल काय सांगतो?","What does this passage tell us about people?":"हा रस्ता आपल्याला लोकांबद्दल काय सांगतो?","If this passage is true, what behaviour should we change this week?":"जर हा रस्ता सत्य असेल तर या आठवड्यात आपण कोणते वर्तन बदलले पाहिजे?","Who will you tell this story to this week?":"या आठवड्यात आपण ही कहाणी कोणास सांगाल?","What needs can we meet in the community this week?":"या आठवड्यात आपण समाजात कोणत्या गरजा पूर्ण करू शकतो?","When do you want to meet again?":"तुला पुन्हा कधी भेटायचं आहे?","Discovry Bible Study":"बायबल अभ्यास","Discus with Friends":"मित्रांसह डिस्कस","Would you like to discover with your friends what God is like and how God want you to live?":"देव कसा आहे आणि देव आपण कसे जगावे अशी देवाची इच्छा आहे हे आपल्या मित्रांसह आपण शोधू इच्छिता?","Here are some questions to get your discussion started.":"आपली चर्चा सुरू करण्यासाठी येथे काही प्रश्न आहेत.","Read more":"पुढे वाचा","Would you like to discover for yourself what God is like and how God want you to live?":"देव कसा आहे आणि आपण कसे जगावे अशी देवाची इच्छा आहे हे आपण स्वतःसाठी शोधू इच्छिता?","Most people like to make these discoveries in a group with their friends.":"बहुतेक लोकांना हे शोध त्यांच्या मित्रांसह एका गटात करणे आवडते.","Read more\r":"पुढे वाचा\r"}