{"Look Back":"Ħares lura","Look Up":"Ħares il-fuq","Look Forward":"Ħares 'il quddiem","What are you thankful for this week?":"X'int grat għal din il-ġimgħa?","What are you struggling with and how can we help?":"Ma 'xiex qed tissara u kif nistgħu ngħinu?","How did you put into practice the scripture\/story we studied last time we met?":"Kif poġġejt fil-prattika l-Iskrittura \/ storja li studjajna l-aħħar darba li ltqajna?","Who did you share last week's lesson with and how did it go?":"Ma 'min qsamt il-lezzjoni tal-ġimgħa li għaddiet u kif marret?","What needs did you meet in the community last week?":"X’teħtieġ iltqajt fil-komunità l-ġimgħa li għaddiet?","Ask someone to read the passage one paragraph at a time.":"Staqsi lil xi ħadd biex jaqra s-silta paragrafu wieħed kull darba.","Have a group member tell it in their own words.":"Ikollhom membru tal-grupp jgħidlu fi kliemhom.","Ask the group if they added anything or left anything out.":"Staqsi lill-grupp jekk żiedu xejn jew ħallew xi ħaġa barra.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Meta tispiċċa bil-paragrafi kollha, staqsi lil xi ħadd fil-grupp biex jgħid l-istorja kollha bil-memorja. Ikollok il-grupp jikkoreġi kwalunkwe żball.","What does this passage tell us about God?":"Xi tgħidilna din is-silta dwar Alla?","What does this passage tell us about people?":"Xi tgħidilna din is-silta dwar in-nies?","If this passage is true, what behaviour should we change this week?":"Jekk din is-silta hija vera, liema mġieba għandna nibdlu din il-ġimgħa?","Who will you tell this story to this week?":"Min se tgħid din l-istorja għal din il-ġimgħa?","What needs can we meet in the community this week?":"X'teħtieġ nistgħu niltaqgħu fil-komunità din il-ġimgħa?","When do you want to meet again?":"Meta trid terġa 'tiltaqa'?","Discovry Bible Study":"Studju tal-Bibbja jiskopri","Discus with Friends":"Diska mal-ħbieb","Would you like to discover with your friends what God is like and how God want you to live?":"Tixtieq tiskopri ma 'sħabek kif Alla hu u kif Alla jrid li tgħix?","Here are some questions to get your discussion started.":"Hawn xi mistoqsijiet biex tibda d-diskussjoni tiegħek.","Read more":"Aqra iktar","Would you like to discover for yourself what God is like and how God want you to live?":"Tixtieq tiskopri għalik innifsek kif inhu Alla u kif Alla jrid li tgħix?","Most people like to make these discoveries in a group with their friends.":"Ħafna nies jħobbu jagħmlu dawn l-iskoperti fi grupp ma 'sħabhom.","Read more\r":"Aqra iktar\r"}