{"Look Back":"Vegere paş","Look Up":"Peyda kirin","Look Forward":"Ji dil libenê man","What are you thankful for this week?":"Hûn ji bo vê hefteyê çi spas dikin?","What are you struggling with and how can we help?":"Hûn bi çi awayî têkoşîn dikin û em çawa dikarin alîkariyê bikin?","How did you put into practice the scripture\/story we studied last time we met?":"We çawa kir ku hûn nivîsa \/ çîrokê ku me dema ku em pê re hevdîtin kir, we pratîkê kir?","Who did you share last week's lesson with and how did it go?":"Kî we dersê hefteya çûyî parve kir û çawa ew çû?","What needs did you meet in the community last week?":"Hefteya çûyî we di civatê de çi hewce kir?","Ask someone to read the passage one paragraph at a time.":"Ji yekî bipirsin ku di yek carekê de derbasbûna yek paragrafê bixwîne.","Have a group member tell it in their own words.":"Endamê komê bi gotinên xwe re vebêjin.","Ask the group if they added anything or left anything out.":"Heke wan tiştek zêde kiriye an jî tiştek ji holê rabikin bipirsin.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Gava ku hûn bi hemî paragrafan re biqedînin, ji yekî di komê de bipirsin ku tevahiya çîrokê bi bîranînê vebêjin. Koma komê xeletiyên rast bikin.","What does this passage tell us about God?":"Ev derbasbûn ji Xwedê re çi dibêje?","What does this passage tell us about people?":"Ev derbasbûn ji me re çi dibêje?","If this passage is true, what behaviour should we change this week?":"Ger ev derbasbûn rast e, divê em vê hefteyê çi bikin?","Who will you tell this story to this week?":"Hûn ê vê hefteyê vê çîrokê ji kê re vebêjin?","What needs can we meet in the community this week?":"Ma em vê hefteyê çi hewce dikin ku em dikarin di civatê de bicivin?","When do you want to meet again?":"Kengî hûn dixwazin dîsa hevdîtin bikin?","Discovry Bible Study":"Lêkolîna Mizgîniyê Discovry","Discus with Friends":"Discus bi hevalên xwe re","Would you like to discover with your friends what God is like and how God want you to live?":"Ma hûn dixwazin bi hevalên xwe re kifş bikin ka Xwedê çi ye û çawa Xwedê dixwazî bijî?","Here are some questions to get your discussion started.":"Li vir çend pirs hene ku hûn nîqaşa we dest pê bikin.","Read more":"Zêdetir bixwînin","Would you like to discover for yourself what God is like and how God want you to live?":"Ma hûn dixwazin ji bo xwe kifş bikin ka Xwedê çi ye û çawa Xwedê dixwazî ku hûn bijîn?","Most people like to make these discoveries in a group with their friends.":"Pir kes hez dikin ku van komek bi hevalên xwe re bikin.","Read more\r":"Zêdetir bixwînin\r"}