{"Look Back":"Atskatīties","Look Up":"Uzmeklēt","Look Forward":"Skaties uz priekšu","What are you thankful for this week?":"Par ko tu esi pateicīgs par šo nedēļu?","What are you struggling with and how can we help?":"Ar ko jūs cīnāties un kā mēs varam palīdzēt?","How did you put into practice the scripture\/story we studied last time we met?":"Kā jūs izmantojāt Rakstu\/stāstu, kuru mēs pētījām pagājušajā reizē, kad tikāmies?","Who did you share last week's lesson with and how did it go?":"Ar ko jūs dalījāties pagājušās nedēļas nodarbībā un kā tas gāja?","What needs did you meet in the community last week?":"Kādas vajadzības jūs satiku sabiedrībā pagājušajā nedēļā?","Ask someone to read the passage one paragraph at a time.":"Palūdziet kādam izlasīt fragmentu vienā rindkopā vienlaikus.","Have a group member tell it in their own words.":"Lieciet grupas dalībniekam to pateikt savos vārdos.","Ask the group if they added anything or left anything out.":"Pajautājiet grupai, vai viņi kaut ko pievieno vai kaut ko atstāja.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kad esat pabeidzis ar visām rindkopām, palūdziet kādam grupas dalībniekam pastāstīt visu stāstu pēc atmiņas. Lieciet grupai labot visas kļūdas.","What does this passage tell us about God?":"Ko šis fragments mums saka par Dievu?","What does this passage tell us about people?":"Ko šis fragments mums stāsta par cilvēkiem?","If this passage is true, what behaviour should we change this week?":"Ja šis fragments ir patiess, kāda uzvedība mums būtu jāmaina šonedēļ?","Who will you tell this story to this week?":"Ko jūs pastāstīsit šo stāstu šai nedēļai?","What needs can we meet in the community this week?":"Kādas vajadzības mēs varam apmierināt sabiedrībā šonedēļ?","When do you want to meet again?":"Kad jūs vēlaties atkal satikties?","Discovry Bible Study":"Disovry Bībeles pētījums","Discus with Friends":"Diskusija ar draugiem","Would you like to discover with your friends what God is like and how God want you to live?":"Vai vēlaties ar draugiem atklāt, kāds ir Dievs un kā Dievs vēlas, lai jūs dzīvotu?","Here are some questions to get your discussion started.":"Šeit ir daži jautājumi, lai sāktu diskusiju.","Read more":"Lasīt vairāk","Would you like to discover for yourself what God is like and how God want you to live?":"Vai vēlaties sev atklāt, kāds ir Dievs un kā Dievs vēlas, lai jūs dzīvotu?","Most people like to make these discoveries in a group with their friends.":"Lielākajai daļai cilvēku patīk veikt šos atklājumus grupā kopā ar draugiem.","Read more\r":"Lasīt vairāk\r"}