{"Look Back":"Uită-te înapoi","Look Up":"Priveşte în sus","Look Forward":"Aștept cu nerăbdare","What are you thankful for this week?":"Pentru ce ești recunoscător pentru această săptămână?","What are you struggling with and how can we help?":"Cu ce te lupți și cum putem ajuta?","How did you put into practice the scripture\/story we studied last time we met?":"Cum ați pus în practică Scriptura\/povestea pe care am studiat -o ultima dată când ne -am întâlnit?","Who did you share last week's lesson with and how did it go?":"Cu cine ai împărtășit lecția de săptămâna trecută și cum a mers?","What needs did you meet in the community last week?":"Ce nevoi v -ați întâmpinat în comunitate săptămâna trecută?","Ask someone to read the passage one paragraph at a time.":"Rugați pe cineva să citească pasajul un paragraf la un moment dat.","Have a group member tell it in their own words.":"Solicitați unui membru al grupului să -i spună în propriile lor cuvinte.","Ask the group if they added anything or left anything out.":"Întrebați grupul dacă au adăugat ceva sau au lăsat ceva.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Când terminați cu toate paragrafele, cereți pe cineva din grup să spună întreaga poveste prin memorie. Solicitați grupului să corecteze eventualele erori.","What does this passage tell us about God?":"Ce ne spune acest pasaj despre Dumnezeu?","What does this passage tell us about people?":"Ce ne spune acest pasaj despre oameni?","If this passage is true, what behaviour should we change this week?":"Dacă acest pasaj este adevărat, ce comportament ar trebui să ne schimbăm săptămâna aceasta?","Who will you tell this story to this week?":"Pe cine vei spune această poveste până săptămâna asta?","What needs can we meet in the community this week?":"Ce nevoi ne putem satisface în comunitate săptămâna aceasta?","When do you want to meet again?":"Când vrei să te întâlnești din nou?","Discovry Bible Study":"Studiu biblic descoperit","Discus with Friends":"Discus cu prietenii","Would you like to discover with your friends what God is like and how God want you to live?":"Doriți să descoperiți împreună cu prietenii dvs. cum este Dumnezeu și cum vrea Dumnezeu să trăiți?","Here are some questions to get your discussion started.":"Iată câteva întrebări pentru a începe discuția.","Read more":"Citeşte mai mult","Would you like to discover for yourself what God is like and how God want you to live?":"Ai vrea să descoperi pentru tine cum este Dumnezeu și cum vrea Dumnezeu să trăiești?","Most people like to make these discoveries in a group with their friends.":"Majoritatea oamenilor le place să facă aceste descoperiri într -un grup cu prietenii.","Read more\r":"Citeşte mai mult\r"}