{"Look Back":"I-boot camp","Look Up":"Bheka","Look Forward":"Bheka Phambili","What are you thankful for this week?":"Yini oyibonga ngaleli sonto?","What are you struggling with and how can we help?":"Yini olwela ngayo nokuthi singasiza kanjani?","How did you put into practice the scripture\/story we studied last time we met?":"Usebenzise kanjani umBhalo \/ Indaba esasifunda ngayo okokugcina sihlangane?","Who did you share last week's lesson with and how did it go?":"Uhlanganyele nobani isifundo seviki eledlule futhi kwahamba kanjani?","What needs did you meet in the community last week?":"Ngabe uhlangana naziphi izidingo emphakathini ngeledlule?","Ask someone to read the passage one paragraph at a time.":"Cela umuntu ukuthi afunde indinyana isigaba esisodwa ngasikhathi.","Have a group member tell it in their own words.":"Ilungu leqembu likutshele ngamazwi abo.","Ask the group if they added anything or left anything out.":"Buza iqembu uma bengeze noma yini noma bashiye lutho ngaphandle.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Lapho uqeda ngazo zonke izigaba, cela umuntu othile eqenjini ukuthi atshele yonke le ndaba ngememori. Iqembu lilungise noma yimaphi amaphutha.","What does this passage tell us about God?":"Ngabe le ndima isitshela ini ngoNkulunkulu?","What does this passage tell us about people?":"Ngabe le ndima isitshelani ngabantu?","If this passage is true, what behaviour should we change this week?":"Uma le ndima iyiqiniso, yikuphi ukuziphatha okufanele sikushintshe kuleli sonto?","Who will you tell this story to this week?":"Ubani ozoyisho le ndaba kuleli sonto?","What needs can we meet in the community this week?":"Yiziphi izidingo esingahlangana nazo emphakathini kuleli sonto?","When do you want to meet again?":"Ufuna ukuhlangana nini futhi?","Discovry Bible Study":"Yazisa Isifundo SeBhayibheli","Discus with Friends":"Discus nabangane","Would you like to discover with your friends what God is like and how God want you to live?":"Ungathanda ukuthola nabangane bakho ukuthi uNkulunkulu unjani nokuthi uNkulunkulu ufuna uphile kanjani?","Here are some questions to get your discussion started.":"Nayi eminye imibuzo ukuze iqale ingxoxo yakho.","Read more":"Funda kabanzi","Would you like to discover for yourself what God is like and how God want you to live?":"Ungathanda ukuzitholela ngokwakho lokho uNkulunkulu akuthandayo nokuthi uNkulunkulu ufuna uphile kanjani?","Most people like to make these discoveries in a group with their friends.":"Iningi labantu lithanda ukwenza lokhu kutholakele eqenjini nabangane babo.","Read more\r":"Funda kabanzi\r"}