{"Look Back":"Féach Ar ais","Look Up":"Féach suas","Look Forward":"Táim ag tnúth","What are you thankful for this week?":"Cad é atá tú buíoch as an tseachtain seo?","What are you struggling with and how can we help?":"Cad é atá tú ag streachailt agus conas is féidir linn cabhrú?","How did you put into practice the scripture\/story we studied last time we met?":"Cén chaoi ar chuir tú an scrioptúr\/an scéal a ndearna muid staidéar air an uair dheireanach a bhuail muid i bhfeidhm?","Who did you share last week's lesson with and how did it go?":"Cé leis a roinn tú ceacht na seachtaine seo caite agus conas a chuaigh sé?","What needs did you meet in the community last week?":"Cad iad na riachtanais a bhuail tú sa phobal an tseachtain seo caite?","Ask someone to read the passage one paragraph at a time.":"Iarr ar dhuine mír amháin a léamh ag an am.","Have a group member tell it in their own words.":"Iarr ar bhall an ghrúpa é a insint ina bhfocail féin.","Ask the group if they added anything or left anything out.":"Fiafraigh den ghrúpa má chuir siad rud ar bith leis nó má d'fhág siad aon rud amach.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Nuair a chríochnaíonn tú leis na míreanna go léir, iarr ar dhuine sa ghrúpa an scéal iomlán a insint trí chuimhne. Iarr ar an ngrúpa aon earráidí a cheartú.","What does this passage tell us about God?":"Cad a insíonn an sliocht seo dúinn faoi Dhia?","What does this passage tell us about people?":"Cad a insíonn an sliocht seo dúinn faoi dhaoine?","If this passage is true, what behaviour should we change this week?":"Má tá an sliocht seo fíor, cén t -iompar ba chóir dúinn a athrú an tseachtain seo?","Who will you tell this story to this week?":"Cé a inseoidh tú an scéal seo don tseachtain seo?","What needs can we meet in the community this week?":"Cad iad na riachtanais is féidir linn bualadh leis sa phobal an tseachtain seo?","When do you want to meet again?":"Cathain ar mhaith leat bualadh le chéile arís?","Discovry Bible Study":"Staidéar Bíobla Discovry","Discus with Friends":"Discus le cairde","Would you like to discover with your friends what God is like and how God want you to live?":"Ar mhaith leat a fháil amach le do chairde cén chuma atá ar Dhia agus conas a theastaíonn ó Dhia tú a bheith i do chónaí?","Here are some questions to get your discussion started.":"Seo roinnt ceisteanna chun tús a chur le do phlé.","Read more":"Leigh Nios mo","Would you like to discover for yourself what God is like and how God want you to live?":"Ar mhaith leat a fháil amach duit féin cén chuma atá ar Dhia agus conas a theastaíonn ó Dhia tú a bheith i do chónaí?","Most people like to make these discoveries in a group with their friends.":"Is maith le formhór na ndaoine na fionnachtana seo a dhéanamh i ngrúpa lena gcairde.","Read more\r":"Leigh Nios mo\r"}