{"Look Back":"Visszanéz","Look Up":"Nézz fel","Look Forward":"Nézz előre","What are you thankful for this week?":"Mi hálás vagy a hétért?","What are you struggling with and how can we help?":"Mire küzdesz és hogyan tudunk segíteni?","How did you put into practice the scripture\/story we studied last time we met?":"Hogyan tette a gyakorlatba a szentírást\/történetet, amelyet utoljára tanultunk, amikor találkoztunk?","Who did you share last week's lesson with and how did it go?":"Kivel osztoztad meg a múlt heti leckét, és hogyan ment?","What needs did you meet in the community last week?":"Mire volt szüksége a múlt héten a közösségben?","Ask someone to read the passage one paragraph at a time.":"Kérd meg valakit, hogy olvassa el a szakaszot egyszerre egy bekezdést.","Have a group member tell it in their own words.":"Kérd meg egy csoporttagot, hogy mondd el a saját szavaikban.","Ask the group if they added anything or left anything out.":"Kérdezze meg a csoportot, ha hozzáadtak -e valamit, vagy hagytak el valamit.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Amikor az összes bekezdést befejezi, kérje meg a csoportot, hogy mondja el az egész történetet a memóriával. Hogy a csoport javítsa a csoportot.","What does this passage tell us about God?":"Mit mond ez a rész Istenről?","What does this passage tell us about people?":"Mit mond ez a szakasz az emberekről?","If this passage is true, what behaviour should we change this week?":"Ha ez a rész igaz, akkor milyen viselkedést kell változtatnunk ezen a héten?","Who will you tell this story to this week?":"Ki fogod elmondani ezt a történetet ezen a héten?","What needs can we meet in the community this week?":"Milyen igényeket tudunk találkozni a közösségben ezen a héten?","When do you want to meet again?":"Mikor akarsz újra találkozni?","Discovry Bible Study":"Discovry Biblia tanulmány","Discus with Friends":"Discuss a barátokkal","Would you like to discover with your friends what God is like and how God want you to live?":"Szeretné felfedezni a barátaiddal, hogy mi az Isten, és hogyan akarja Isten élni?","Here are some questions to get your discussion started.":"Íme néhány kérdés, hogy megkezdődjön a beszélgetés.","Read more":"Olvass tovább","Would you like to discover for yourself what God is like and how God want you to live?":"Szeretné felfedezni magadnak, hogy mi az Isten, és hogyan akarja Isten élni?","Most people like to make these discoveries in a group with their friends.":"A legtöbb ember szereti ezeket a felfedezéseket egy csoportban készíteni a barátaival.","Read more\r":"Olvass tovább\r"}