{"Look Back":"Osvrnuti se","Look Up":"Pogledaj","Look Forward":"Veseliti se","What are you thankful for this week?":"Na čemu ste zahvalni za ovaj tjedan?","What are you struggling with and how can we help?":"S čime se borite i kako možemo pomoći?","How did you put into practice the scripture\/story we studied last time we met?":"Kako ste proveli u praksi Sveto pismo\/priču koju smo proučavali prošli put kad smo se upoznali?","Who did you share last week's lesson with and how did it go?":"S kim ste podijelili lekciju prošlog tjedna i kako je to prošlo?","What needs did you meet in the community last week?":"Koje ste potrebe prošli tjedan sreli u zajednici?","Ask someone to read the passage one paragraph at a time.":"Zamolite nekoga da odjednom pročita odlomak jedan odlomak.","Have a group member tell it in their own words.":"Neka član grupe kaže vlastitim riječima.","Ask the group if they added anything or left anything out.":"Pitajte grupu jesu li nešto dodali ili ostavili nešto.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kad završite sa svim odlomcima, zamolite nekoga iz grupe da cijelu priču ispriča po sjećanju. Neka grupa ispravi bilo kakve pogreške.","What does this passage tell us about God?":"Što nam ovaj odlomak govori o Bogu?","What does this passage tell us about people?":"Što nam ovaj odlomak govori o ljudima?","If this passage is true, what behaviour should we change this week?":"Ako je ovaj odlomak istinit, kakvo bismo ponašanje trebali promijeniti ovaj tjedan?","Who will you tell this story to this week?":"Kome ćete ovaj tjedan ispričati ovu priču?","What needs can we meet in the community this week?":"Koje smo potrebe ovog tjedna u zajednici?","When do you want to meet again?":"Kada se želite ponovno upoznati?","Discovry Bible Study":"Discry Biblija proučava","Discus with Friends":"Diskus s prijateljima","Would you like to discover with your friends what God is like and how God want you to live?":"Želite li otkriti sa svojim prijateljima kakav je Bog i kako Bog želi da živite?","Here are some questions to get your discussion started.":"Evo nekoliko pitanja za pokretanje vaše rasprave.","Read more":"Čitaj više","Would you like to discover for yourself what God is like and how God want you to live?":"Želite li sami otkriti kakav je Bog i kako Bog želi da živite?","Most people like to make these discoveries in a group with their friends.":"Većina ljudi voli ta otkrića u grupi sa svojim prijateljima.","Read more\r":"Čitaj više\r"}