{"Look Back":"Mirar cap enrere","Look Up":"Cercar","Look Forward":"Espero","What are you thankful for this week?":"Què agraeixes aquesta setmana?","What are you struggling with and how can we help?":"Amb què lluites i com podem ajudar?","How did you put into practice the scripture\/story we studied last time we met?":"Com vas posar en pràctica les Escriptures\/Story que vam estudiar la darrera vegada que ens vam conèixer?","Who did you share last week's lesson with and how did it go?":"Amb qui vau compartir la lliçó de la setmana passada i com va anar?","What needs did you meet in the community last week?":"Quines necessitats us heu reunit a la comunitat la setmana passada?","Ask someone to read the passage one paragraph at a time.":"Demaneu a algú que llegeixi el paràgraf del passatge alhora.","Have a group member tell it in their own words.":"Feu que un membre del grup ho expliqui amb les seves pròpies paraules.","Ask the group if they added anything or left anything out.":"Pregunteu al grup si van afegir alguna cosa o van deixar res fora.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Quan acabeu amb tots els paràgrafs, demaneu a algú del grup que expliqui tota la història per memòria. Feu que el grup corregeixi els errors.","What does this passage tell us about God?":"Què ens diu aquest passatge sobre Déu?","What does this passage tell us about people?":"Què ens diu aquest passatge sobre la gent?","If this passage is true, what behaviour should we change this week?":"Si aquest passatge és cert, quin comportament hem de canviar aquesta setmana?","Who will you tell this story to this week?":"A qui explicaràs aquesta història aquesta setmana?","What needs can we meet in the community this week?":"Quines necessitats podem satisfer a la comunitat aquesta setmana?","When do you want to meet again?":"Quan vols tornar -te a trobar?","Discovry Bible Study":"Estudi de la Bíblia Descobrida","Discus with Friends":"Disc amb amics","Would you like to discover with your friends what God is like and how God want you to live?":"Voleu descobrir amb els vostres amics com és Déu i com Déu vol que visqueu?","Here are some questions to get your discussion started.":"A continuació, es mostren algunes preguntes per començar la vostra discussió.","Read more":"Llegeix més","Would you like to discover for yourself what God is like and how God want you to live?":"Voleu descobrir per vosaltres mateixos com és Déu i com Déu vol que visqueu?","Most people like to make these discoveries in a group with their friends.":"A la majoria de la gent els agrada fer aquests descobriments en un grup amb els seus amics.","Read more\r":"Llegeix més\r"}