{"Look Back":"ပြန်ကြည့်ပါ","Look Up":"ဦးမော့လာသည်","Look Forward":"မျှော်လင့်ပါတယ်","What are you thankful for this week?":"ဒီအပတ်အတွက်ဘာကျေးဇူးတင်နေတာလဲ","What are you struggling with and how can we help?":"သင်ဘာနှင့်ရုန်းကန်နေရသနည်း, ကျွန်ုပ်တို့မည်သို့ကူညီနိုင်သနည်း။","How did you put into practice the scripture\/story we studied last time we met?":"ကျွန်ုပ်တို့လေ့လာခဲ့သည့်ကျမ်းစာ \/ ပုံပြင်ကိုကျွန်ုပ်တို့လေ့လာခဲ့သည့်ကျမ်းစာ \/ ပုံပြင်ကိုမည်သို့လက်တွေ့ကျင့်သုံးခဲ့သနည်း။","Who did you share last week's lesson with and how did it go?":"ပြီးခဲ့သည့်အပတ်ကသင်ခန်းစာကိုမည်သူမျှဝေခဲ့သနည်း, မည်သို့သွားသနည်း။","What needs did you meet in the community last week?":"ပြီးခဲ့သည့်အပတ်ကရပ်ရွာထဲတွင်သင်မည်သည့်လိုအပ်ချက်များနှင့်တွေ့ဆုံခဲ့သနည်း။","Ask someone to read the passage one paragraph at a time.":"တစ်ကြိမ်တွင်စာပိုဒ်တစ်ပိုဒ်ကိုဖတ်ရန်တစ်စုံတစ် ဦး ကိုတောင်းဆိုပါ။","Have a group member tell it in their own words.":"အုပ်စုဖွဲ့အဖွဲ့ဝင်တစ် ဦး ကသူတို့ကိုယ်ပိုင်စကားဖြင့်ပြောပြပါ။","Ask the group if they added anything or left anything out.":"သူတို့ကဘာမှဆက်ပြောသည်သို့မဟုတ်တစ်ခုခုကျန်ရစ်လျှင်အုပ်စုအားမေးပါ။","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"စာပိုဒ်အားလုံးနှင့်သင်ပြီးဆုံးပါကအုပ်စုထဲမှတစ်စုံတစ် ဦး အားပုံပြင်တစ်ခုလုံးကိုမှတ်ဉာဏ်ဖြင့်ပြောပြရန်ပြောပါ။ အုပ်စုသည်မည်သည့်အမှားများကိုမဆိုပြင်ပေးပါ။","What does this passage tell us about God?":"ဒီကျမ်းပိုဒ်ကဘုရားသခင်အကြောင်းဘာကိုပြောပြသလဲ။","What does this passage tell us about people?":"ဒီကျမ်းပိုဒ်ကလူတွေအကြောင်းဘာတွေပြောပြသလဲ။","If this passage is true, what behaviour should we change this week?":"ဒီကျမ်းပိုဒ်ကမှန်တယ်ဆိုရင်ဒီရက်သတ္တပတ်မှာအဘယ်အပြုအမူကိုပြောင်းလဲသင့်သနည်း။","Who will you tell this story to this week?":"ဒီပုံပြင်ကိုဒီအပတ်မှာဘယ်သူပြောမလဲ။","What needs can we meet in the community this week?":"ယခုအပတ်တွင်ရပ်ရွာလူထုတွင်ကျွန်ုပ်တို့တွေ့ဆုံနိုင်မည်နည်း။","When do you want to meet again?":"ဘယ်အချိန်မှာထပ်တွေ့ချင်လဲ","Discovry Bible Study":"ကျမ်းစာလေ့လာမှုကိုငြင်းစရာ","Discus with Friends":"သူငယ်ချင်းများနှင့်အတူ discus","Would you like to discover with your friends what God is like and how God want you to live?":"သင်၏မိတ်ဆွေများနှင့်ဘုရားသခင်မည်သို့တူသနည်း,","Here are some questions to get your discussion started.":"သင်၏ဆွေးနွေးမှုကိုစတင်ရန်မေးခွန်းအချို့ရှိသည်။","Read more":"ပိုပြီးဖတ်ပါ","Would you like to discover for yourself what God is like and how God want you to live?":"ဘုရားသခင်ဘယ်လိုဆက်ဆံသလဲ, ဘုရားသခင်ကသင့်ကိုဘယ်လိုနေထိုင်စေချင်သလဲဆိုတာကိုသင်ကိုယ်တိုင်ရှာဖွေချင်ပါသလား။","Most people like to make these discoveries in a group with their friends.":"လူအများစုကဒီရှာဖွေတွေ့ရှိမှုတွေကိုသူငယ်ချင်းတွေနဲ့အုပ်စုတစ်စုမှာလုပ်ချင်ကြတယ်။","Read more\r":"ပိုပြီးဖတ်ပါ\r"}