{"Look Back":"Ka soo dhowaa","Look Up":"Fiica","Look Forward":"Fiiri","What are you thankful for this week?":"Maxaad ugu mahadcelineysaa toddobaadkan?","What are you struggling with and how can we help?":"Maxaad la halgameysaa oo sidee baan u caawin karnaa?","How did you put into practice the scripture\/story we studied last time we met?":"Sideed ku celcelisay ku dhaqanka Qorniinka \/ sheekada aan barannay markii ugu dambeysay ee aan la kulannay?","Who did you share last week's lesson with and how did it go?":"Yaad la wadaagtay casharka usbuucii hore ee la socda oo sidee bay u dhacday?","What needs did you meet in the community last week?":"Waa maxay baahiyaha aad ku kulantay bulshada usbuucii hore?","Ask someone to read the passage one paragraph at a time.":"Weydiiso qof inuu akhriyo marinka hal sadar markiiba.","Have a group member tell it in their own words.":"Hayso xubin koox koox ah u sheeg ereyadooda.","Ask the group if they added anything or left anything out.":"Weydii kooxda haddii ay ku daraan wax ama wax kasta oo banaanka ah.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Markaad dhammeysid dhammaan sadarka, weydii qof ka mid ah kooxda inuu u sheego sheekada oo dhan xusuus. Kooxda ha saxeexdo wixii khaladaad ah.","What does this passage tell us about God?":"Muxuu qoraalkani nooga sheegayaa Ilaah?","What does this passage tell us about people?":"Muxuu qoraalkani noogagagagaga sheegayaa dadka?","If this passage is true, what behaviour should we change this week?":"Haddii tuducdan ay run tahay, dabeecad noocee ah ayaan badali karnaa toddobaadkan?","Who will you tell this story to this week?":"Kumaad sheekadan u sheegtaa sheekadan toddobaadkan?","What needs can we meet in the community this week?":"Maxay yihiin baahiyaha aan ku kulmi karno bulshada toddobaadkan?","When do you want to meet again?":"Goormaad dooneysaa inaad mar kale la kulanto?","Discovry Bible Study":"Baadhitaanka Baadhitaanka Baybalka","Discus with Friends":"Kala qaybi asxaabta","Would you like to discover with your friends what God is like and how God want you to live?":"Ma jeceshahay inaad la ogaato saaxiibbadaa waxa Ilaah la mid yahay iyo sida Eebbe u doonayo inaad ku noolaato?","Here are some questions to get your discussion started.":"Waa kuwan qaar ka mid ah su'aalaha si aad doodahaaga u bilowdo.","Read more":"Akhri wax dheeraad ah","Would you like to discover for yourself what God is like and how God want you to live?":"Ma jeceshahay inaad naftaada ogaato waxa Ilaah la mid yahay iyo sida Eebbe u doonayo inaad ku noolaato?","Most people like to make these discoveries in a group with their friends.":"Dadka badankood waxay jecel yihiin inay ka dhigaan daah-furka kuwan asxaabtooda.","Read more\r":"Akhri wax dheeraad ah\r"}