{"Look Back":"Yzyna seret","Look Up":"Seresap boluň","Look Forward":"Geljege üns ber","What are you thankful for this week?":"Bu hepde üçin näletin şükür edýärsiňizmi?","What are you struggling with and how can we help?":"Näme bilen göreşýärsiňiz we nädip kömek edip bileris?","How did you put into practice the scripture\/story we studied last time we met?":"Mukaddes Strable \/ hekaýamyzy nädip öwrendiňiz?","Who did you share last week's lesson with and how did it go?":"Geçen hepde geçen hepdäniň sapagyny kim paýlaşdyňyz we nädip gitdi?","What needs did you meet in the community last week?":"Geçen hepde jemgyýetde näme etmeli?","Ask someone to read the passage one paragraph at a time.":"Biriniň bir gezekde bir abzasy okamagy haýyş etmegini haýyş ediň.","Have a group member tell it in their own words.":"Toparlaýyn agza öz sözlerinde aýdýarlar.","Ask the group if they added anything or left anything out.":"Topardan bir zat goşsa ýa-da hiç zat goýsalardan soraň.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Ähli abzaslar bilen gutaranyňyzda, toparda bir wakany tutuş wakany ýatda aýtmagyny haýyş ediň. Toparyň haýsydyr bir ýalňyşlyklary düzetmesini düzüň.","What does this passage tell us about God?":"Bu bölüm näme, bize Hudaý hakda bize habar berýär?","What does this passage tell us about people?":"Bu bölüm näme bilen meşgullanýar?","If this passage is true, what behaviour should we change this week?":"Bu geçelge dogry bolsa, şu hepde haýsy hereketleri üýtgetmeli?","Who will you tell this story to this week?":"Bu hekaýany şu hepde görersiňiz?","What needs can we meet in the community this week?":"Bu hepde jemgyýetde näme bilen duşuşyp bileris?","When do you want to meet again?":"Haçan ýene duşuşmak isleýärsiňiz?","Discovry Bible Study":"Rightver ROMASY OF KONSERI ÖSÜŞ","Discus with Friends":"Dostlar bilen taşlaň","Would you like to discover with your friends what God is like and how God want you to live?":"Dostlaryňyz bilen hudaýyň nämedigini we Hudaýyň sizi ýaşamagyňyzy isleýändigiňizi nädip ösdürip bilersiňiz?","Here are some questions to get your discussion started.":"Ara alyp maslahatlaşmak üçin käbir soraglar başlar.","Read more":"Koprak oka","Would you like to discover for yourself what God is like and how God want you to live?":"Hudaýyň nämedigini we Hudaýyň sizi ýaşamagyňyzy isleýändigiňizi görmek isleýärsiňizmi?","Most people like to make these discoveries in a group with their friends.":"Köp adamlar bu açyşlary dostlary bilen toparda ýasamagy halaýarlar.","Read more\r":"Koprak oka\r"}