{"Look Back":"Pogledaj nazad","Look Up":"Pogledaj gore","Look Forward":"Gledaj naprijed","What are you thankful for this week?":"Šta ste zahvalni za ovu sedmicu?","What are you struggling with and how can we help?":"Sa čime se boriš i kako možemo pomoći?","How did you put into practice the scripture\/story we studied last time we met?":"Kako ste unijeli u praksi Sveto pismo \/ priču koju smo proučavali posljednji put kad smo se upoznali?","Who did you share last week's lesson with and how did it go?":"Sa kim ste delili prošlu nedeljunu lekciju i kako je prošlo?","What needs did you meet in the community last week?":"Koje su vam potrebe upoznali u zajednici prošle sedmice?","Ask someone to read the passage one paragraph at a time.":"Zamolite nekoga da pročita odlomak jedan odlomak po jedan.","Have a group member tell it in their own words.":"Neka član kaže u svojim riječima.","Ask the group if they added anything or left anything out.":"Pitajte grupu ako su nešto dodali ili ostavili bilo što izvučene.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kada završite sa svim odlomcima, zamolite nekoga u grupi da ispriča cijelu priču memorije. Neka grupa ispravite bilo kakve greške.","What does this passage tell us about God?":"Šta nam ovaj odlomak govori o Bogu?","What does this passage tell us about people?":"Šta nam govori ovaj odlomak o ljudima?","If this passage is true, what behaviour should we change this week?":"Ako je ovaj odlomak istinita, koje ponašanje trebamo promijeniti ove sedmice?","Who will you tell this story to this week?":"Koga ćete ovu priču reći u ovoj sedmici?","What needs can we meet in the community this week?":"Koje potrebe možemo da se sastanemo u zajednici ove sedmice?","When do you want to meet again?":"Kada se želite ponovo sresti?","Discovry Bible Study":"Diskovit biblijski studij","Discus with Friends":"Diskus sa prijateljima","Would you like to discover with your friends what God is like and how God want you to live?":"Da li biste željeli otkriti sa svojim prijateljima što je Bog i kako Bog želi da živite?","Here are some questions to get your discussion started.":"Evo nekoliko pitanja koja bi započela vaša diskusija.","Read more":"Čitaj više","Would you like to discover for yourself what God is like and how God want you to live?":"Želite li otkriti sebi što je Bog poput i kako Bog želi da živite?","Most people like to make these discoveries in a group with their friends.":"Većina ljudi voli da ova otkrića u grupi sa svojim prijateljima.","Read more\r":"Čitaj više\r"}