{"Look Back":"Saib rov qab","Look Up":"Saib kom sawv","Look Forward":"Tos ntsoov","What are you thankful for this week?":"Koj ua tsaug rau lub lim tiam no yog dab tsi?","What are you struggling with and how can we help?":"Dab tsi yog koj tawm tsam nrog thiab peb tuaj yeem pab tau li cas?","How did you put into practice the scripture\/story we studied last time we met?":"Ua li cas koj tau muab cov ntawv dab neeg \/ zaj dab neeg peb tau kawm tas los peb tau ntsib?","Who did you share last week's lesson with and how did it go?":"Koj tau qhia leej twg lub lim tiam dhau los ua ke nrog thiab nws mus li cas?","What needs did you meet in the community last week?":"Koj yuav tsum tau ntsib dab tsi hauv zej tsoom zej zog?","Ask someone to read the passage one paragraph at a time.":"Hais kom lwm tus nyeem kab lus ib ntu zuj zus.","Have a group member tell it in their own words.":"Muaj ib tug tswvcuab hauv pawg qhia nws hauv lawv cov lus.","Ask the group if they added anything or left anything out.":"Hais kom pab pawg yog tias lawv tau ntxiv dab tsi los yog sab laug dab tsi.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Thaum koj ua tiav nrog tag nrho cov lus, nug ib tug neeg hauv pab pawg los qhia tag nrho zaj dab neeg los ntawm kev nco. Muaj pab pawg kho qhov tsis raug.","What does this passage tell us about God?":"Cov nqe lus no qhia peb txog Vajtswv li cas?","What does this passage tell us about people?":"Cov nqe lus no qhia peb txog cov neeg li cas?","If this passage is true, what behaviour should we change this week?":"Yog tias nqe lus no muaj tseeb, peb yuav tsum hloov tus cwj pwm twg?","Who will you tell this story to this week?":"Koj yuav qhia zaj dab neeg no rau lub lim tiam no?","What needs can we meet in the community this week?":"Dab tsi xav tau peb tau sib ntsib hauv zej zog lub lim tiam no?","When do you want to meet again?":"Thaum twg koj xav ntsib dua?","Discovry Bible Study":"Kev Kawm Ntawv Kev Kawm Ntawv Vajlugkub","Discus with Friends":"Discus nrog phooj ywg","Would you like to discover with your friends what God is like and how God want you to live?":"Koj puas xav nrhiav tau koj cov phooj ywg uas Vajtswv yog tus zoo li cas thiab qhov uas Vajtswv xav kom koj nyob?","Here are some questions to get your discussion started.":"Nov yog qee cov lus nug kom tau koj kev sib tham tau pib.","Read more":"Nyeem ntxiv","Would you like to discover for yourself what God is like and how God want you to live?":"Koj puas xav nrhiav tau rau koj tus kheej uas Vajtswv yog leej twg thiab yuav ua li cas Vajtswv xav kom koj nyob?","Most people like to make these discoveries in a group with their friends.":"Cov neeg feem coob nyiam ua cov kev tshawb nrhiav no hauv pab pawg nrog lawv cov phooj ywg.","Read more\r":"Nyeem ntxiv\r"}