{"Look Back":"Se tilbage","Look Up":"Kig op","Look Forward":"Se fremad","What are you thankful for this week?":"Hvad er du taknemmelig for denne uge?","What are you struggling with and how can we help?":"Hvad kæmper du med, og hvordan kan vi hjælpe?","How did you put into practice the scripture\/story we studied last time we met?":"Hvordan udøvede du det skrift\/historie, vi studerede sidste gang, vi mødte?","Who did you share last week's lesson with and how did it go?":"Hvem delte du sidste uges lektion med, og hvordan gik det?","What needs did you meet in the community last week?":"Hvilke behov opfyldte du i samfundet i sidste uge?","Ask someone to read the passage one paragraph at a time.":"Bed nogen om at læse passagen et afsnit ad gangen.","Have a group member tell it in their own words.":"Få et gruppemedlem til at fortælle det med deres egne ord.","Ask the group if they added anything or left anything out.":"Spørg gruppen, om de tilføjede noget eller udeladte noget.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Når du er færdig med alle afsnit, skal du bede nogen i gruppen om at fortælle hele historien efter hukommelsen. Lad gruppen rette eventuelle fejl.","What does this passage tell us about God?":"Hvad fortæller denne passage os om Gud?","What does this passage tell us about people?":"Hvad fortæller denne passage os om mennesker?","If this passage is true, what behaviour should we change this week?":"Hvis denne passage er sand, hvilken adfærd skal vi ændre denne uge?","Who will you tell this story to this week?":"Hvem vil du fortælle denne historie til denne uge?","What needs can we meet in the community this week?":"Hvilke behov kan vi imødekomme i samfundet denne uge?","When do you want to meet again?":"Hvornår vil du mødes igen?","Discovry Bible Study":"Diskovær bibelstudie","Discus with Friends":"Discus med venner","Would you like to discover with your friends what God is like and how God want you to live?":"Vil du med dine venner opdage, hvordan Gud er, og hvordan Gud vil have dig til at leve?","Here are some questions to get your discussion started.":"Her er nogle spørgsmål for at få din diskussion i gang.","Read more":"Læs mere","Would you like to discover for yourself what God is like and how God want you to live?":"Vil du selv opdage, hvordan Gud er, og hvordan Gud vil have dig til at leve?","Most people like to make these discoveries in a group with their friends.":"De fleste mennesker kan lide at gøre disse opdagelser i en gruppe med deres venner.","Read more\r":"Læs mere\r"}