{"Look Back":"Артка көз чаптыр","Look Up":"Издөө","Look Forward":"Чыдамсыздык менен","What are you thankful for this week?":"Ушул жумада эмне үчүн рахмат?","What are you struggling with and how can we help?":"Эмне менен күрөшүп жатасың жана кантип жардам бере алабыз?","How did you put into practice the scripture\/story we studied last time we met?":"Акыркы жолу жолукканыбызга жазылган аяттаны \/ окуяны кантип ишке ашырдыңыз?","Who did you share last week's lesson with and how did it go?":"Сиз өткөн жумада сабакка кимди бөлүштү жана ал кандайча жүрдүңүз?","What needs did you meet in the community last week?":"Өткөн жумада жамаатта кандай муктаждыктарыңызды жолуктурдуңыз?","Ask someone to read the passage one paragraph at a time.":"Бирөөнүн бир-абзацты бир-бир абзацты окууну сураныңыз.","Have a group member tell it in their own words.":"Бул топ мүчөсү муну өз сөзсүз түрдө айтыңыз.","Ask the group if they added anything or left anything out.":"Топтон бир нерсе кошуп, эч нерсе таштап кетсе, сураңыз.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Бардык абзацтар менен бүткөндөн кийин, топтогу бирөөдөн бир окуяны эс тутум аркылуу айтып берүүсүн сураныңыз. Топту кандайдыр бир каталарды оңдоп алыңыз.","What does this passage tell us about God?":"Бул үзүндү бизге Кудай жөнүндө эмнени билүүгө болот?","What does this passage tell us about people?":"Бул үзүндү бизге адамдар жөнүндө эмнени айтып берет?","If this passage is true, what behaviour should we change this week?":"Эгер бул үзүндү чын болсо, ушул жумада кандай жүрүм-турумду өзгөртүшүбүз керек?","Who will you tell this story to this week?":"Бул окуяны ушул жумада кимге айтып берет?","What needs can we meet in the community this week?":"Ушул жумада жамаатта эмнеге жолугсак болот?","When do you want to meet again?":"Кайра жолугууну каалайсызбы?","Discovry Bible Study":"Ыйык Китепти дискуралык Ыйык Китепти изилдөө","Discus with Friends":"Достор менен диск","Would you like to discover with your friends what God is like and how God want you to live?":"Кудай сизге кандай мамиле кылганын жана Кудайды кандайча жашагыңыз келеби?","Here are some questions to get your discussion started.":"Бул жерде сиздин талкууңузду баштоо үчүн бир нече суроолор.","Read more":"Кененирээк маалымат","Would you like to discover for yourself what God is like and how God want you to live?":"Өзүңүзгө Кудай кандай экениңизди жана Кудайды кандайча жашагыңыз келеби?","Most people like to make these discoveries in a group with their friends.":"Көпчүлүк адамдар досторуңуз менен досторуңуз менен бир топко келишкенди жакшы көрүшөт.","Read more\r":"Кененирээк маалымат\r"}