{"Look Back":"Katon maneh","Look Up":"Goleki","Look Forward":"Katon maju","What are you thankful for this week?":"Apa sampeyan matur nuwun kanggo minggu iki?","What are you struggling with and how can we help?":"Apa sing sampeyan berjuang karo lan kepiye bisa mbantu?","How did you put into practice the scripture\/story we studied last time we met?":"Kepiye sampeyan nglatih tulisan \/ crita sing diteliti wektu pungkasan kita ketemu?","Who did you share last week's lesson with and how did it go?":"Sapa sing nuduhake pelajaran minggu kepungkur lan kepiye?","What needs did you meet in the community last week?":"Apa sing dibutuhake ing komunitas minggu kepungkur?","Ask someone to read the passage one paragraph at a time.":"Takone wong maca paragraf siji sekaligus.","Have a group member tell it in their own words.":"Duwe anggota klompok nyritakake tembunge dhewe.","Ask the group if they added anything or left anything out.":"Takon grup yen nambahi apa-apa utawa ora ana apa-apa.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Yen wis rampung karo kabeh paragraf, takon karo wong liya ing kabeh klompok kasebut kanthi memori. Duwe grup mbenerake kesalahan.","What does this passage tell us about God?":"Apa sing dicritakake babagan Gusti Allah?","What does this passage tell us about people?":"Apa sing dicritakake babagan wong liya?","If this passage is true, what behaviour should we change this week?":"Yen wacana iki bener, apa prilaku sing kudu kita ganti minggu iki?","Who will you tell this story to this week?":"Sapa sing bakal ngerti crita iki ing minggu iki?","What needs can we meet in the community this week?":"Apa sing kudu kita lakoni ing komunitas minggu iki?","When do you want to meet again?":"Nalika sampeyan pengin ketemu maneh?","Discovry Bible Study":"Sinau Kitab Suci Discovry","Discus with Friends":"Discus karo kanca-kanca","Would you like to discover with your friends what God is like and how God want you to live?":"Apa sampeyan pengin nemokake karo kanca-kanca apa sing dikepengini karo Gusti Allah lan kepiye Gusti Allah sampeyan manggon?","Here are some questions to get your discussion started.":"Mangkene sawetara pitakon kanggo entuk diskusi sampeyan.","Read more":"Waca liyane","Would you like to discover for yourself what God is like and how God want you to live?":"Apa sampeyan pengin nemokake apa sing disenengi karo Gusti Allah lan kepiye Gusti Allah sampeyan manggon?","Most people like to make these discoveries in a group with their friends.":"Umume wong seneng nemokake penemuan kasebut ing klompok karo kanca-kancane.","Read more\r":"Waca liyane\r"}