{"Look Back":"Оглянутись","Look Up":"Шукати","Look Forward":"З нетерпінням чекати","What are you thankful for this week?":"Що ти вдячний за цей тиждень?","What are you struggling with and how can we help?":"З чим ти борешся і як ми можемо допомогти?","How did you put into practice the scripture\/story we studied last time we met?":"Як ви застосували на практиці Писання\/історію, яку ми вивчали востаннє, коли ми зустрічалися?","Who did you share last week's lesson with and how did it go?":"З ким ви поділилися уроком минулого тижня і як це пройшло?","What needs did you meet in the community last week?":"Які потреби ви задовольнили в громаді минулого тижня?","Ask someone to read the passage one paragraph at a time.":"Попросіть когось прочитати уривок по одному абзаці.","Have a group member tell it in their own words.":"Попросіть члена групи розповісти це власними словами.","Ask the group if they added anything or left anything out.":"Запитайте у групи, чи додали вони що -небудь чи нічого не залишили.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Коли ви закінчите всі абзаци, попросіть когось із групи розповісти всю історію за пам’яттю. Нехай група виправляє будь -які помилки.","What does this passage tell us about God?":"Що цей уривок говорить нам про Бога?","What does this passage tell us about people?":"Що цей уривок говорить нам про людей?","If this passage is true, what behaviour should we change this week?":"Якщо цей уривок є правдивим, яку поведінку ми повинні змінити на цьому тижні?","Who will you tell this story to this week?":"Кому ви розповадите цю історію на цьому тижні?","What needs can we meet in the community this week?":"Які потреби ми можемо задовольнити в громаді цього тижня?","When do you want to meet again?":"Коли ви хочете знову зустрітися?","Discovry Bible Study":"Дископія вивчення Біблії","Discus with Friends":"Дискус з друзями","Would you like to discover with your friends what God is like and how God want you to live?":"Чи хотіли б ви відкрити з друзями, що таке Бог, і як Бог хоче, щоб ви жили?","Here are some questions to get your discussion started.":"Ось кілька питань, щоб розпочати свою дискусію.","Read more":"Детальніше","Would you like to discover for yourself what God is like and how God want you to live?":"Чи хотіли б ви відкрити для себе, що таке Бог і як Бог хоче, щоб ви жили?","Most people like to make these discoveries in a group with their friends.":"Більшість людей люблять робити ці відкриття в групі зі своїми друзями.","Read more\r":"Детальніше\r"}