{"Look Back":"ਪਿਛੇ ਦੇਖੋ","Look Up":"ਝਾਂਕਨਾ","Look Forward":"ਸਾਮਣੇ ਵੇਖੋ","What are you thankful for this week?":"ਤੁਸੀਂ ਇਸ ਹਫਤੇ ਕਿਸ ਸ਼ੁਕਰਗੁਜ਼ਾਰ ਹੋ?","What are you struggling with and how can we help?":"ਤੁਸੀਂ ਕਿਸ ਨਾਲ ਸੰਘਰਸ਼ ਕਰ ਰਹੇ ਹੋ ਅਤੇ ਅਸੀਂ ਕਿਵੇਂ ਮਦਦ ਕਰ ਸਕਦੇ ਹਾਂ?","How did you put into practice the scripture\/story we studied last time we met?":"ਜਦੋਂ ਅਸੀਂ ਪਿਛਲੀ ਵਾਰ ਮੁਲਾਕਾਤ ਕੀਤੀ ਉਸ ਹਵਾਲੇ \/ ਕਹਾਣੀ ਦਾ ਅਭਿਆਸ ਕੀਤਾ ਗਿਆ?","Who did you share last week's lesson with and how did it go?":"ਤੁਸੀਂ ਕਿਸਨੇ ਪਿਛਲੇ ਹਫ਼ਤੇ ਦੇ ਸਬਕ ਨੂੰ ਸਾਂਝਾ ਕੀਤਾ ਅਤੇ ਇਹ ਕਿਵੇਂ ਗਿਆ?","What needs did you meet in the community last week?":"ਪਿਛਲੇ ਹਫਤੇ ਕਮਿ youkh ਨਿਟੀ ਵਿੱਚ ਤੁਸੀਂ ਕਿਹੜੀਆਂ ਜ਼ਰੂਰਤਾਂ ਪੂਰੀਆਂ ਕੀਤੀਆਂ?","Ask someone to read the passage one paragraph at a time.":"ਕਿਸੇ ਨੂੰ ਕਿਸੇ ਸਮੇਂ ਬੀਤਣ ਵਾਲੇ ਬੀਤਣ ਨੂੰ ਪੜ੍ਹਨ ਲਈ ਕਹੋ.","Have a group member tell it in their own words.":"ਇੱਕ ਸਮੂਹ ਮੈਂਬਰ ਨੂੰ ਆਪਣੇ ਸ਼ਬਦਾਂ ਵਿੱਚ ਦੱਸੋ.","Ask the group if they added anything or left anything out.":"ਸਮੂਹ ਨੂੰ ਪੁੱਛੋ ਕਿ ਕੀ ਉਨ੍ਹਾਂ ਨੇ ਕੁਝ ਜੋੜਿਆ ਜਾਂ ਬਾਹਰ ਛੱਡ ਦਿੱਤਾ.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"ਜਦੋਂ ਤੁਸੀਂ ਸਾਰੇ ਪ੍ਹੈਰੇ ਨਾਲ ਖਤਮ ਕਰਦੇ ਹੋ, ਕਿਸੇ ਨੂੰ ਸਾਰੇ ਕਹਾਣੀ ਨੂੰ ਮੈਮੋਰੀ ਨਾਲ ਦੱਸਣ ਲਈ ਕਹੋ. ਸਮੂਹ ਕਿਸੇ ਵੀ ਗਲਤੀ ਨੂੰ ਠੀਕ ਕਰੋ.","What does this passage tell us about God?":"ਇਹ ਹਵਾਲਾ ਸਾਨੂੰ ਰੱਬ ਬਾਰੇ ਕੀ ਦੱਸਦਾ ਹੈ?","What does this passage tell us about people?":"ਇਹ ਹਵਾਲਾ ਸਾਨੂੰ ਲੋਕਾਂ ਬਾਰੇ ਕੀ ਦੱਸਦਾ ਹੈ?","If this passage is true, what behaviour should we change this week?":"ਜੇ ਇਹ ਬੀਤਣ ਸਹੀ ਹੈ, ਤਾਂ ਸਾਨੂੰ ਇਸ ਹਫਤੇ ਕਿਹੜਾ ਵਿਵਹਾਰ ਬਦਲਣਾ ਚਾਹੀਦਾ ਹੈ?","Who will you tell this story to this week?":"ਤੁਸੀਂ ਇਸ ਕਹਾਣੀ ਨੂੰ ਇਸ ਹਫਤੇ ਕਿਸ ਨੂੰ ਦੱਸੋਗੇ?","What needs can we meet in the community this week?":"ਇਸ ਹਫਤੇ ਅਸੀਂ ਕਿਹੜੀਆਂ ਜ਼ਰੂਰਤਾਂ ਨੂੰ ਪੂਰਾ ਕਰ ਸਕਦੇ ਹਾਂ?","When do you want to meet again?":"ਤੁਸੀਂ ਦੁਬਾਰਾ ਕਦੋਂ ਮਿਲਣਾ ਚਾਹੁੰਦੇ ਹੋ?","Discovry Bible Study":"ਬਾਈਬਲ ਅਧਿਐਨ ਕਰੋ","Discus with Friends":"ਦੋਸਤਾਂ ਨਾਲ ਡਿਸਕਸ","Would you like to discover with your friends what God is like and how God want you to live?":"ਕੀ ਤੁਸੀਂ ਆਪਣੇ ਦੋਸਤਾਂ ਨਾਲ ਖੋਜ ਕਰਨਾ ਚਾਹੋਗੇ ਕਿ ਰੱਬ ਕਿਹੋ ਜਿਹਾ ਹੈ ਅਤੇ ਪਰਮੇਸ਼ੁਰ ਚਾਹੁੰਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਵੇਂ ਜੀਉਣਾ ਚਾਹੁੰਦੇ ਹੋ?","Here are some questions to get your discussion started.":"ਤੁਹਾਡੀ ਚਰਚਾ ਸ਼ੁਰੂ ਕਰਨ ਲਈ ਇੱਥੇ ਕੁਝ ਪ੍ਰਸ਼ਨ ਹਨ.","Read more":"ਹੋਰ ਪੜ੍ਹੋ","Would you like to discover for yourself what God is like and how God want you to live?":"ਕੀ ਤੁਸੀਂ ਆਪਣੇ ਲਈ ਖੋਜਣਾ ਚਾਹੁੰਦੇ ਹੋ ਕਿ ਰੱਬ ਕਿਹੋ ਜਿਹਾ ਹੈ ਅਤੇ ਪਰਮੇਸ਼ੁਰ ਚਾਹੁੰਦਾ ਹੈ ਕਿ ਤੁਸੀਂ ਕਿਵੇਂ ਜੀਓਗੇ?","Most people like to make these discoveries in a group with their friends.":"ਬਹੁਤੇ ਲੋਕ ਇਨ੍ਹਾਂ ਖੋਜਾਂ ਨੂੰ ਆਪਣੇ ਦੋਸਤਾਂ ਨਾਲ ਇੱਕ ਸਮੂਹ ਵਿੱਚ ਬਣਾਉਣਾ ਪਸੰਦ ਕਰਦੇ ਹਨ.","Read more\r":"ਹੋਰ ਪੜ੍ਹੋ\r"}