{"Look Back":"Mirar atrás","Look Up":"Buscar","Look Forward":"Miramos cara adiante","What are you thankful for this week?":"Que agradeces esta semana?","What are you struggling with and how can we help?":"Con que loitas e como podemos axudar?","How did you put into practice the scripture\/story we studied last time we met?":"Como puxeches en práctica a Escritura\/historia que estudamos a última vez que nos coñecemos?","Who did you share last week's lesson with and how did it go?":"Con quen compartiches a lección da semana pasada e como foi?","What needs did you meet in the community last week?":"Que necesidades atopaches na comunidade a semana pasada?","Ask someone to read the passage one paragraph at a time.":"Pídelle a alguén que lea o paso dun parágrafo á vez.","Have a group member tell it in their own words.":"Que un membro do grupo o diga nas súas propias palabras.","Ask the group if they added anything or left anything out.":"Pregúntalle ao grupo se engadiron algo ou deixaron algo fóra.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Cando remates con todos os parágrafos, pídelle a alguén do grupo que conte a toda a historia por memoria. Faga que o grupo corrixa calquera erro.","What does this passage tell us about God?":"Que nos di esta pasaxe sobre Deus?","What does this passage tell us about people?":"Que nos di esta pasaxe sobre a xente?","If this passage is true, what behaviour should we change this week?":"Se esta pasaxe é certo, que comportamento debemos cambiar esta semana?","Who will you tell this story to this week?":"A quen contarás esta historia esta semana?","What needs can we meet in the community this week?":"Que necesidades podemos satisfacer na comunidade esta semana?","When do you want to meet again?":"Cando queres atoparte de novo?","Discovry Bible Study":"Descobre estudo bíblico","Discus with Friends":"Discus cos amigos","Would you like to discover with your friends what God is like and how God want you to live?":"¿Quere descubrir cos teus amigos como é Deus e como Deus quere que vivas?","Here are some questions to get your discussion started.":"Aquí tes algunhas preguntas para comezar a túa discusión.","Read more":"Le máis","Would you like to discover for yourself what God is like and how God want you to live?":"¿Quere descubrir por si mesmo como é Deus e como Deus quere que vivas?","Most people like to make these discoveries in a group with their friends.":"A maioría da xente gústalle facer estes descubrimentos nun grupo cos seus amigos.","Read more\r":"Le máis\r"}