{"Look Back":"Melihat ke belakang","Look Up":"Cari ke atas","Look Forward":"Melihat ke hadapan","What are you thankful for this week?":"Apa yang anda bersyukur untuk minggu ini?","What are you struggling with and how can we help?":"Apa yang anda perjuangkan dan bagaimana kita boleh membantu?","How did you put into practice the scripture\/story we studied last time we met?":"Bagaimanakah anda mengamalkan kitab suci\/cerita yang kami pelajari kali terakhir kami bertemu?","Who did you share last week's lesson with and how did it go?":"Dengan siapa anda berkongsi pelajaran minggu lalu dan bagaimana keadaannya?","What needs did you meet in the community last week?":"Apa yang diperlukan yang anda temui dalam komuniti minggu lepas?","Ask someone to read the passage one paragraph at a time.":"Minta seseorang membaca petikan satu perenggan pada satu masa.","Have a group member tell it in their own words.":"Mempunyai ahli kumpulan menceritakannya dengan kata -kata mereka sendiri.","Ask the group if they added anything or left anything out.":"Tanya kumpulan jika mereka menambah apa -apa atau meninggalkan apa -apa.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Apabila anda selesai dengan semua perenggan, tanya seseorang dalam kumpulan untuk memberitahu keseluruhan cerita dengan ingatan. Adakah kumpulan membetulkan sebarang kesilapan.","What does this passage tell us about God?":"Apakah petikan ini memberitahu kita tentang Tuhan?","What does this passage tell us about people?":"Apakah petikan ini memberitahu kita tentang orang?","If this passage is true, what behaviour should we change this week?":"Sekiranya petikan ini benar, apakah tingkah laku yang harus kita ubah minggu ini?","Who will you tell this story to this week?":"Siapa yang akan anda ceritakan pada minggu ini?","What needs can we meet in the community this week?":"Apa keperluan yang boleh kita temui dalam komuniti minggu ini?","When do you want to meet again?":"Bilakah anda mahu bertemu lagi?","Discovry Bible Study":"Kajian Alkitab yang tidak disengajakan","Discus with Friends":"Diskus dengan rakan","Would you like to discover with your friends what God is like and how God want you to live?":"Adakah anda ingin menemui rakan -rakan anda bagaimana Tuhan dan bagaimana Tuhan mahu anda hidup?","Here are some questions to get your discussion started.":"Berikut adalah beberapa soalan untuk memulakan perbincangan anda.","Read more":"Baca lebih lanjut","Would you like to discover for yourself what God is like and how God want you to live?":"Adakah anda ingin mengetahui sendiri bagaimana Tuhan dan bagaimana Tuhan mahu anda hidup?","Most people like to make these discoveries in a group with their friends.":"Kebanyakan orang suka membuat penemuan ini dalam kumpulan dengan rakan -rakan mereka.","Read more\r":"Baca lebih lanjut\r"}