{"Look Back":"Se tillbaka","Look Up":"Slå upp","Look Forward":"Titta framåt","What are you thankful for this week?":"Vad är du tacksam för den här veckan?","What are you struggling with and how can we help?":"Vad kämpar du med och hur kan vi hjälpa till?","How did you put into practice the scripture\/story we studied last time we met?":"Hur genomförde du skriften\/berättelsen som vi studerade förra gången vi träffade?","Who did you share last week's lesson with and how did it go?":"Vem delade du förra veckans lektion med och hur gick det?","What needs did you meet in the community last week?":"Vilka behov mötte du i samhället förra veckan?","Ask someone to read the passage one paragraph at a time.":"Be någon att läsa avsnittet ett stycke åt gången.","Have a group member tell it in their own words.":"Låt en gruppmedlem berätta för det med sina egna ord.","Ask the group if they added anything or left anything out.":"Fråga gruppen om de har lagt till något eller lämnade något.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"När du är klar med alla stycken, be någon i gruppen att berätta hela historien med minnet. Låt gruppen korrigera eventuella fel.","What does this passage tell us about God?":"Vad berättar detta avsnitt om Gud?","What does this passage tell us about people?":"Vad berättar detta avsnitt om människor?","If this passage is true, what behaviour should we change this week?":"Om det här avsnittet är sant, vilket beteende ska vi ändra den här veckan?","Who will you tell this story to this week?":"Vem kommer du att berätta den här historien till den här veckan?","What needs can we meet in the community this week?":"Vilka behov kan vi tillgodose i samhället den här veckan?","When do you want to meet again?":"När vill du träffas igen?","Discovry Bible Study":"Discoverry Bible Study","Discus with Friends":"Diskus med vänner","Would you like to discover with your friends what God is like and how God want you to live?":"Vill du upptäcka med dina vänner hur Gud är och hur Gud vill att du ska leva?","Here are some questions to get your discussion started.":"Här är några frågor för att få din diskussion igång.","Read more":"Läs mer","Would you like to discover for yourself what God is like and how God want you to live?":"Vill du själv upptäcka hur Gud är och hur Gud vill att du ska leva?","Most people like to make these discoveries in a group with their friends.":"De flesta gillar att göra dessa upptäckter i en grupp med sina vänner.","Read more\r":"Läs mer\r"}