{"Look Back":"Ба ақиб нигаред","Look Up":"Ҷустуҷӯ кардан","Look Forward":"Мунтазир шудан","What are you thankful for this week?":"Шумо барои ин ҳафта чӣ мегӯед?","What are you struggling with and how can we help?":"Шумо чӣ кор мекунед ва чӣ гуна кӯмак карда метавонем?","How did you put into practice the scripture\/story we studied last time we met?":"Чӣ гуна шумо дар амалияи Навиштаҷот ва вақти охирини омӯхтаатон ба амал овардем?","Who did you share last week's lesson with and how did it go?":"Шумо дарси ҳафтаи гузашта кӣ мубодила кардед ва чӣ гуна рафт?","What needs did you meet in the community last week?":"Шумо дар ҳафтае, ки дар ҷомеа мулоқот кардаед?","Ask someone to read the passage one paragraph at a time.":"Аз касе хоҳиш кунед, ки порчаи як параграфро дар як вақт хонад.","Have a group member tell it in their own words.":"Узви гурӯҳро бо суханони худ гӯед.","Ask the group if they added anything or left anything out.":"Аз гурӯҳ пурсед, ки агар онҳо ягон чизро илова кунанд ё аз чизе даст кашанд.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Вақте ки шумо бо тамоми сархатҳо тамом мекунед, аз касе аз касе пурсед, ки тамоми достонро тавассути хотира нақл кунед. Оё гурӯҳ ягон хатогиҳоро ислоҳ мекунанд.","What does this passage tell us about God?":"Ин порча дар бораи Худо чӣ мегӯяд?","What does this passage tell us about people?":"Ин порча дар бораи одамон чӣ мегӯяд?","If this passage is true, what behaviour should we change this week?":"Агар ин порча дуруст бошад, мо бояд ин ҳафта чӣ гуна рафторро ислоҳ кунем?","Who will you tell this story to this week?":"Шумо ба ин ҳикоя дар ин ҳафта кӣ мегӯед?","What needs can we meet in the community this week?":"Дар ин ҳафта мо бояд чӣ гуна эҳтиёҷҳоро пешкаш карда метавонем?","When do you want to meet again?":"Кай шумо мехоҳед вохӯред боз вохӯред?","Discovry Bible Study":"Омӯзиши омӯзиши Китоби Муқаддас","Discus with Friends":"Диски бо дӯстон","Would you like to discover with your friends what God is like and how God want you to live?":"Мехоҳед дӯстони худро кашед, ки Худо ба чӣ монанд аст ва Худо мехоҳад, ки шумо зиндагӣ кунед?","Here are some questions to get your discussion started.":"Инҳоянд саволҳо барои гирифтани муҳокимаи шумо.","Read more":"Бештар","Would you like to discover for yourself what God is like and how God want you to live?":"Оё шумо мехостед, ки шумо чӣ гуна аст, ки Худо чӣ гуна аст ва чӣ гуна Худо мехоҳад, зиндагӣ кардан мехоҳед?","Most people like to make these discoveries in a group with their friends.":"Аксарияти мардум мехоҳанд, ки ин кашфҳоро дар гурӯҳ бо дӯстони худ кунанд.","Read more\r":"Бештар\r"}