{"Look Back":"ಹಿಂತಿರುಗಿ ನೋಡಿ","Look Up":"ಮೇಲೆ ನೋಡು","Look Forward":"ಎದುರುನೋಡಬಹುದು","What are you thankful for this week?":"ಈ ವಾರಕ್ಕೆ ನೀವು ಏನು ಕೃತಜ್ಞರಾಗಿರುತ್ತೀರಿ?","What are you struggling with and how can we help?":"ನೀವು ಏನು ಹೋರಾಡುತ್ತಿದ್ದೀರಿ ಮತ್ತು ನಾವು ಹೇಗೆ ಸಹಾಯ ಮಾಡಬಹುದು?","How did you put into practice the scripture\/story we studied last time we met?":"ನಾವು ಭೇಟಿಯಾದ ಕೊನೆಯ ಬಾರಿ ನಾವು ಅಧ್ಯಯನ ಮಾಡಿದ ಧರ್ಮಗ್ರಂಥ\/ಕಥೆಯನ್ನು ನೀವು ಹೇಗೆ ಆಚರಣೆಗೆ ತಂದಿದ್ದೀರಿ?","Who did you share last week's lesson with and how did it go?":"ಕಳೆದ ವಾರದ ಪಾಠವನ್ನು ನೀವು ಯಾರೊಂದಿಗೆ ಹಂಚಿಕೊಂಡಿದ್ದೀರಿ ಮತ್ತು ಅದು ಹೇಗೆ ಹೋಯಿತು?","What needs did you meet in the community last week?":"ಕಳೆದ ವಾರ ಸಮುದಾಯದಲ್ಲಿ ನೀವು ಏನು ಭೇಟಿಯಾದರು?","Ask someone to read the passage one paragraph at a time.":"ಒಂದು ಸಮಯದಲ್ಲಿ ಒಂದು ಪ್ಯಾರಾಗ್ರಾಫ್ ಅನ್ನು ಪ್ಯಾಸೇಜ್ ಓದಲು ಯಾರನ್ನಾದರೂ ಕೇಳಿ.","Have a group member tell it in their own words.":"ಗುಂಪಿನ ಸದಸ್ಯರು ಅದನ್ನು ತಮ್ಮ ಮಾತಿನಲ್ಲಿ ಹೇಳಲಿ.","Ask the group if they added anything or left anything out.":"ಅವರು ಏನನ್ನಾದರೂ ಸೇರಿಸಿದರೆ ಅಥವಾ ಏನನ್ನಾದರೂ ಬಿಟ್ಟರೆ ಗುಂಪನ್ನು ಕೇಳಿ.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"ನೀವು ಎಲ್ಲಾ ಪ್ಯಾರಾಗಳೊಂದಿಗೆ ಮುಗಿಸಿದಾಗ, ಗುಂಪಿನಲ್ಲಿರುವ ಯಾರನ್ನಾದರೂ ಇಡೀ ಕಥೆಯನ್ನು ಸ್ಮರಣೆಯಿಂದ ಹೇಳಲು ಹೇಳಿ. ಗುಂಪು ಯಾವುದೇ ದೋಷಗಳನ್ನು ಸರಿಪಡಿಸಿ.","What does this passage tell us about God?":"ಈ ಭಾಗವು ದೇವರ ಬಗ್ಗೆ ಏನು ಹೇಳುತ್ತದೆ?","What does this passage tell us about people?":"ಈ ಭಾಗವು ಜನರ ಬಗ್ಗೆ ಏನು ಹೇಳುತ್ತದೆ?","If this passage is true, what behaviour should we change this week?":"ಈ ಭಾಗವು ನಿಜವಾಗಿದ್ದರೆ, ಈ ವಾರ ನಾವು ಯಾವ ನಡವಳಿಕೆಯನ್ನು ಬದಲಾಯಿಸಬೇಕು?","Who will you tell this story to this week?":"ಈ ವಾರಕ್ಕೆ ಈ ಕಥೆಯನ್ನು ನೀವು ಯಾರಿಗೆ ಹೇಳುತ್ತೀರಿ?","What needs can we meet in the community this week?":"ಈ ವಾರ ಸಮುದಾಯದಲ್ಲಿ ನಾವು ಏನು ಭೇಟಿಯಾಗಬಹುದು?","When do you want to meet again?":"ನೀವು ಯಾವಾಗ ಮತ್ತೆ ಭೇಟಿಯಾಗಲು ಬಯಸುತ್ತೀರಿ?","Discovry Bible Study":"ಡಿಸ್ಕೋವ್ರಿ ಬೈಬಲ್ ಅಧ್ಯಯನ","Discus with Friends":"ಸ್ನೇಹಿತರೊಂದಿಗೆ ಡಿಸ್ಕಸ್","Would you like to discover with your friends what God is like and how God want you to live?":"ದೇವರು ಹೇಗಿದ್ದಾನೆ ಮತ್ತು ನೀವು ಹೇಗೆ ಬದುಕಬೇಕೆಂದು ದೇವರು ಬಯಸುತ್ತಾನೆ ಎಂದು ನಿಮ್ಮ ಸ್ನೇಹಿತರೊಂದಿಗೆ ಕಂಡುಹಿಡಿಯಲು ನೀವು ಬಯಸುವಿರಾ?","Here are some questions to get your discussion started.":"ನಿಮ್ಮ ಚರ್ಚೆಯನ್ನು ಪ್ರಾರಂಭಿಸಲು ಕೆಲವು ಪ್ರಶ್ನೆಗಳು ಇಲ್ಲಿವೆ.","Read more":"ಮತ್ತಷ್ಟು ಓದು","Would you like to discover for yourself what God is like and how God want you to live?":"ದೇವರು ಹೇಗಿದ್ದಾನೆ ಮತ್ತು ನೀವು ಹೇಗೆ ಬದುಕಬೇಕೆಂದು ದೇವರು ಬಯಸುತ್ತಾನೆ ಎಂಬುದನ್ನು ನೀವೇ ಕಂಡುಹಿಡಿಯಲು ಬಯಸುವಿರಾ?","Most people like to make these discoveries in a group with their friends.":"ಹೆಚ್ಚಿನ ಜನರು ಈ ಆವಿಷ್ಕಾರಗಳನ್ನು ತಮ್ಮ ಸ್ನೇಹಿತರೊಂದಿಗೆ ಗುಂಪಿನಲ್ಲಿ ಮಾಡಲು ಇಷ್ಟಪಡುತ್ತಾರೆ.","Read more\r":"ಮತ್ತಷ್ಟು ಓದು\r"}