{"Look Back":"Geriyə baxmaq","Look Up":"Baxmaq","Look Forward":"Gözləmək","What are you thankful for this week?":"Bu həftə üçün nə üçün təşəkkür edirsiniz?","What are you struggling with and how can we help?":"Nə ilə mübarizə aparırsınız və necə kömək edə bilərik?","How did you put into practice the scripture\/story we studied last time we met?":"Son dəfə tanış olduğumuzu öyrəndiyimiz kitab \/ hekayəni necə tətbiq etdiniz?","Who did you share last week's lesson with and how did it go?":"Keçən həftə dərsini kimlə bölüşdün və necə oldu?","What needs did you meet in the community last week?":"Keçən həftə cəmiyyətdə hansı ehtiyacları qarşılamısınız?","Ask someone to read the passage one paragraph at a time.":"Birindən bir paraqrafı bir-bir paraqrafı oxumağı xahiş et.","Have a group member tell it in their own words.":"Bir qrup üzvü bunu öz sözləri ilə söyləyin.","Ask the group if they added anything or left anything out.":"Qrupdan bir şey əlavə etsələr və ya bir şey buraxdıqları təqdirdə soruşun.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Bütün bəndlərlə bitirdikdə, qrupdakı birisini bütün hekayəni yaddaşa görə söyləməsini xahiş edin. Qrup hər hansı bir səhvi düzəldin.","What does this passage tell us about God?":"Bu keçid Allah haqqında nə deyir?","What does this passage tell us about people?":"Bu keçid bizə insanlar haqqında nə deyir?","If this passage is true, what behaviour should we change this week?":"Bu keçid doğrudursa, bu həftə hansı davranış dəyişməliyik?","Who will you tell this story to this week?":"Bu hekayəni bu həftəyə kim söyləyəcəksən?","What needs can we meet in the community this week?":"Bu həftə cəmiyyətdə hansı ehtiyacları ödəyə bilərik?","When do you want to meet again?":"Yenidən nə vaxt görüşmək istəyirsən?","Discovry Bible Study":"Müqəddəs Kitabı","Discus with Friends":"Dostlarla disk","Would you like to discover with your friends what God is like and how God want you to live?":"Dostlarınızla Allahın nə kimi olduğunu və Allahın necə yaşamağını necə istəməsini istərdinizmi?","Here are some questions to get your discussion started.":"Müzakirənizi başlamaq üçün bəzi suallar.","Read more":"Daha çox oxu","Would you like to discover for yourself what God is like and how God want you to live?":"Allahın nə olduğunu və Allahın necə yaşamağını necə istədiyini özünüz üçün kəşf etmək istərdinizmi?","Most people like to make these discoveries in a group with their friends.":"Əksər insanlar bu kəşfləri dostları ilə bir qrupda etməyə sevirlər.","Read more\r":"Daha çox oxu\r"}