{"Look Back":"Jinga emva","Look Up":"Jonga phezulu","Look Forward":"Njonga phambili","What are you thankful for this week?":"Unombulelo kule veki?","What are you struggling with and how can we help?":"Usokola yintoni kwaye sinokunceda njani?","How did you put into practice the scripture\/story we studied last time we met?":"Ubufumene njani iSibhalo \/ ibali esilifundileyo ngalolo xesha sidibana nalo?","Who did you share last week's lesson with and how did it go?":"Unenxaxheba kweyiphi isifundo seveki ephelileyo kwaye yaya njani?","What needs did you meet in the community last week?":"Zeziphi iimfuno odibene nabo ekuhlaleni kwiveki ephelileyo?","Ask someone to read the passage one paragraph at a time.":"Cela umntu ukuba afunde isicatshulwa umhlathi welinye ixesha.","Have a group member tell it in their own words.":"Yiba nelungu leqela elixela ngamazwi abo.","Ask the group if they added anything or left anything out.":"Cela iqela ukuba bongeza nantoni na okanye ishiye into ngaphandle.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Xa ugqibile ngawo onke amaqendu, cela umntu kwiqela ukuba alibalise ibali lonke ngememori. Ngaba iqela lilungisa naziphi na iimpazamo.","What does this passage tell us about God?":"Ithini le ndinyana ngoThixo?","What does this passage tell us about people?":"Ithini le ndinyana ngabantu?","If this passage is true, what behaviour should we change this week?":"Ukuba le ndinyana iyinyani, yeyiphi indlela esifanele siyitshintshe kule veki?","Who will you tell this story to this week?":"Ngubani oza kulixelela eli bali kule veki?","What needs can we meet in the community this week?":"Zeziphi iimfuno esinokudibana nabo ekuhlaleni kule veki?","When do you want to meet again?":"Ufuna ukudibana nini kwakhona?","Discovry Bible Study":"Isifundo seBhayibhile sokuphelisa iBhayibhile","Discus with Friends":"Vumelana nabahlobo","Would you like to discover with your friends what God is like and how God want you to live?":"Ngaba ungathanda ukufumana abahlobo bakho ukuba injani kwaye njani ukuba uphile njani?","Here are some questions to get your discussion started.":"Nantsi imibuzo yokufumana ingxoxo yakho.","Read more":"Funda ngokugqithisileyo","Would you like to discover for yourself what God is like and how God want you to live?":"Ngaba ungathanda ukufumana ngokwakho ukuba unjani kwaye njani ukuba uphile njani?","Most people like to make these discoveries in a group with their friends.":"Uninzi lwabantu luthanda ukwenza ezi zinto zifunyanisiweyo kwiqela nabahlobo babo.","Read more\r":"Funda ngokugqithisileyo\r"}