{"Look Back":"Líta til baka","Look Up":"Horfðu upp","Look Forward":"Hlakka til","What are you thankful for this week?":"Hvað ertu þakklátur fyrir þessa viku?","What are you struggling with and how can we help?":"Hvað ertu að glíma við og hvernig getum við hjálpað?","How did you put into practice the scripture\/story we studied last time we met?":"Hvernig vannstu í framkvæmd ritningarinnar\/sögunnar sem við kynntum okkur síðast þegar við hittumst?","Who did you share last week's lesson with and how did it go?":"Hvern deilir þú í kennslustundinni í síðustu viku og hvernig fór það?","What needs did you meet in the community last week?":"Hvaða þarfir hittir þú í samfélaginu í síðustu viku?","Ask someone to read the passage one paragraph at a time.":"Biðjið einhvern um að lesa leiðina eina málsgrein í einu.","Have a group member tell it in their own words.":"Láttu hópmeðlim segja það með eigin orðum.","Ask the group if they added anything or left anything out.":"Spurðu hópinn hvort þeir bættu við einhverju eða skildu eitthvað eftir.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Þegar þú lýkur með öllum málsgreinum skaltu biðja einhvern í hópnum að segja alla söguna eftir minni. Láttu hópinn leiðrétta allar villur.","What does this passage tell us about God?":"Hvað segir þessi leið okkur um Guð?","What does this passage tell us about people?":"Hvað segir þessi leið okkur um fólk?","If this passage is true, what behaviour should we change this week?":"Ef þessi leið er sönn, hvaða hegðun ættum við að breyta í þessari viku?","Who will you tell this story to this week?":"Hver munt þú segja þessa sögu við þessa viku?","What needs can we meet in the community this week?":"Hvaða þarf getum við hist í samfélaginu í vikunni?","When do you want to meet again?":"Hvenær viltu hittast aftur?","Discovry Bible Study":"Discovry biblíunám","Discus with Friends":"Discus með vinum","Would you like to discover with your friends what God is like and how God want you to live?":"Viltu uppgötva með vinum þínum hvernig Guð er og hvernig Guð vill að þú lifir?","Here are some questions to get your discussion started.":"Hér eru nokkrar spurningar til að koma umræðum þínum af stað.","Read more":"Lestu meira","Would you like to discover for yourself what God is like and how God want you to live?":"Viltu uppgötva sjálfur hvernig Guð er og hvernig Guð vill að þú lifir?","Most people like to make these discoveries in a group with their friends.":"Flestum finnst gaman að gera þessar uppgötvanir í hópi með vinum sínum.","Read more\r":"Lestu meira\r"}