{"Look Back":"回望","Look Up":"抬头","Look Forward":"期待","What are you thankful for this week?":"您对这周有什么感谢？","What are you struggling with and how can we help?":"您在挣扎什么，我们该如何帮助？","How did you put into practice the scripture\/story we studied last time we met?":"您是如何实践我们上次遇到的经文\/故事的？","Who did you share last week's lesson with and how did it go?":"您上周的课程与谁分享？","What needs did you meet in the community last week?":"您上周在社区遇到了什么需求？","Ask someone to read the passage one paragraph at a time.":"要求某人一次阅读一段段落。","Have a group member tell it in their own words.":"让小组成员用自己的话说。","Ask the group if they added anything or left anything out.":"询问小组是否添加了任何东西或遗漏了任何东西。","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"当您完成所有段落时，请小组中的某人通过记忆来讲述整个故事。让小组更正任何错误。","What does this passage tell us about God?":"这段经文告诉我们什么关于上帝？","What does this passage tell us about people?":"这段经文告诉我们有关人们的信息？","If this passage is true, what behaviour should we change this week?":"如果此段落是正确的，那么本周我们应该改变什么行为？","Who will you tell this story to this week?":"您将向本周讲这个故事？","What needs can we meet in the community this week?":"本周我们可以在社区满足什么需要？","When do you want to meet again?":"您什么时候想再次见面？","Discovry Bible Study":"剖析圣经研究","Discus with Friends":"与朋友的铁饼","Would you like to discover with your friends what God is like and how God want you to live?":"您想和您的朋友一起发现上帝的样子，以及上帝希望您如何生活吗？","Here are some questions to get your discussion started.":"以下是一些问题，可以开始讨论。","Read more":"阅读更多","Would you like to discover for yourself what God is like and how God want you to live?":"您想自己发现上帝的样子，以及上帝希望您如何生活吗？","Most people like to make these discoveries in a group with their friends.":"大多数人喜欢与朋友一起在一个小组中发现这些发现。","Read more\r":"阅读更多\r"}