{"Look Back":"Tan-awa ang likod","Look Up":"Tan-aw sa taas","Look Forward":"Tan-awa ang unahan","What are you thankful for this week?":"Unsa man ang imong pasalamatan karong semanaha?","What are you struggling with and how can we help?":"Unsa man ang imong gikahimut-an ug sa unsang paagi kita makatabang?","How did you put into practice the scripture\/story we studied last time we met?":"Giunsa nimo gibutang ang pagtuman sa kasulatan \/ istorya nga among gitun-an sa miaging higayon nga nagkita kami?","Who did you share last week's lesson with and how did it go?":"Kinsa ang imong gipaambit sa katapusan nga leksyon sa miaging semana ug giunsa kini?","What needs did you meet in the community last week?":"Unsa nga mga panginahanglan ang imong nahimamat sa komunidad sa miaging semana?","Ask someone to read the passage one paragraph at a time.":"Hangyoa ang usa ka tawo nga basahon ang tudling sa usa ka parapo matag higayon.","Have a group member tell it in their own words.":"Ipasulti kini sa usa ka miyembro sa grupo sa ilang kaugalingon nga mga pulong.","Ask the group if they added anything or left anything out.":"Pangutan-a ang grupo kung nagdugang sila bisan unsa o wala'y nahabilin.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kung nakatapos ka sa tanan nga mga paragrap, hangyoa ang usa ka tawo sa grupo nga isulti ang tibuuk nga istorya pinaagi sa panumduman. Ipabutang sa grupo ang bisan unsang mga sayup.","What does this passage tell us about God?":"Unsa ang gisulti sa kini nga tudling bahin sa Dios?","What does this passage tell us about people?":"Unsa ang gisulti sa kini nga tudling bahin sa mga tawo?","If this passage is true, what behaviour should we change this week?":"Kung ang kini nga tudling tinuod, unsang pamatasan ang kinahanglan naton usbon kini nga semana?","Who will you tell this story to this week?":"Kinsa ang imong isulti kini nga istorya sa kini nga semana?","What needs can we meet in the community this week?":"Unsa nga mga panginahanglan ang mahimo naton magkita sa komunidad karong semanaha?","When do you want to meet again?":"Kanus-a nimo gusto magkita pag-usab?","Discovry Bible Study":"Discovry Pagtuon sa Bibliya","Discus with Friends":"Discus sa mga higala","Would you like to discover with your friends what God is like and how God want you to live?":"Gusto ba nimo mahibal-an uban sa imong mga higala kung unsa ang sama sa Dios ug kung giunsa ang gusto sa Dios nga imong mabuhi?","Here are some questions to get your discussion started.":"Niini ang pipila ka mga pangutana aron masugdan ang imong panaghisgot.","Read more":"Magbasa pa","Would you like to discover for yourself what God is like and how God want you to live?":"Gusto ba nimo mahibal-an alang sa imong kaugalingon kung unsa ang sama sa Dios ug kung giunsa ang gusto sa Dios nga imong mabuhi?","Most people like to make these discoveries in a group with their friends.":"Kadaghanan sa mga tawo gusto nga kini nga mga nadiskobrehan sa usa ka grupo kauban ang ilang mga higala.","Read more\r":"Magbasa pa\r"}