{"Look Back":"Shiko prapa","Look Up":"Vë në dukje","Look Forward":"Pres","What are you thankful for this week?":"Çfarë jeni mirënjohës për këtë javë?","What are you struggling with and how can we help?":"Me çfarë po luftoni dhe si mund të ndihmojmë?","How did you put into practice the scripture\/story we studied last time we met?":"Si e keni zbatuar shkrimin\/historinë që studiuam herën e fundit që u takuam?","Who did you share last week's lesson with and how did it go?":"Me kë e ndani mësimin e javës së kaluar dhe si shkoi?","What needs did you meet in the community last week?":"Cilat nevoja keni takuar në komunitet javën e kaluar?","Ask someone to read the passage one paragraph at a time.":"Kërkojuni dikujt të lexojë fragmentin një paragraf në një kohë.","Have a group member tell it in their own words.":"Bëni që një anëtar i grupit ta tregojë atë me fjalët e tyre.","Ask the group if they added anything or left anything out.":"Pyesni grupin nëse ata shtuan ndonjë gjë ose lanë ndonjë gjë jashtë.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kur të mbaroni me të gjithë paragrafët, kërkoni dikë në grup të tregojë tërë historinë me kujtesë. Bëni grupin të korrigjojë çdo gabim.","What does this passage tell us about God?":"Doesfarë na tregon kjo pasazh për Zotin?","What does this passage tell us about people?":"Dofarë na tregon kjo pasazh për njerëzit?","If this passage is true, what behaviour should we change this week?":"Nëse kjo fragment është e vërtetë, çfarë sjelljeje duhet të ndryshojmë këtë javë?","Who will you tell this story to this week?":"Kë do ta tregoni këtë histori për këtë javë?","What needs can we meet in the community this week?":"Needfarë nevojash mund të takohemi në komunitet këtë javë?","When do you want to meet again?":"Kur doni të takoheni përsëri?","Discovry Bible Study":"Shfrytëzoni studimin e Biblës","Discus with Friends":"Diskutimi me miqtë","Would you like to discover with your friends what God is like and how God want you to live?":"Dëshironi të zbuloni me miqtë tuaj si është Zoti dhe si dëshiron që Zoti të jetoni?","Here are some questions to get your discussion started.":"Këtu janë disa pyetje për të filluar diskutimin tuaj.","Read more":"Lexo më shumë","Would you like to discover for yourself what God is like and how God want you to live?":"Dëshironi të zbuloni vetë se si është Zoti dhe si dëshiron që Zoti të jetoni?","Most people like to make these discoveries in a group with their friends.":"Shumica e njerëzve u pëlqen t'i bëjnë këto zbulime në një grup me miqtë e tyre.","Read more\r":"Lexo më shumë\r"}