{"Look Back":"ดูข้างหลัง","Look Up":"มองดู","Look Forward":"มองไปข้างหน้า","What are you thankful for this week?":"คุณรู้สึกขอบคุณอะไรในสัปดาห์นี้?","What are you struggling with and how can we help?":"คุณกำลังดิ้นรนอะไรและเราจะช่วยได้อย่างไร?","How did you put into practice the scripture\/story we studied last time we met?":"คุณนำไปปฏิบัติในพระคัมภีร์\/เรื่องราวที่เราศึกษาครั้งสุดท้ายที่เราพบกันได้อย่างไร?","Who did you share last week's lesson with and how did it go?":"คุณแบ่งปันบทเรียนเมื่อสัปดาห์ที่แล้วกับใครและไปได้อย่างไร?","What needs did you meet in the community last week?":"เมื่อสัปดาห์ที่แล้วคุณมีความต้องการอะไรบ้าง?","Ask someone to read the passage one paragraph at a time.":"ขอให้ใครบางคนอ่านข้อความทีละย่อหน้า","Have a group member tell it in their own words.":"ให้สมาชิกกลุ่มบอกมันด้วยคำพูดของตัวเอง","Ask the group if they added anything or left anything out.":"ถามกลุ่มว่าพวกเขาเพิ่มอะไรหรือทิ้งอะไรไว้","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"เมื่อคุณทำทุกย่อหน้าให้ถามใครบางคนในกลุ่มเพื่อบอกเล่าเรื่องราวทั้งหมดด้วยความทรงจำ ให้กลุ่มแก้ไขข้อผิดพลาดใด ๆ","What does this passage tell us about God?":"ข้อความนี้บอกอะไรเราเกี่ยวกับพระเจ้า?","What does this passage tell us about people?":"ข้อความนี้บอกอะไรเราเกี่ยวกับผู้คน?","If this passage is true, what behaviour should we change this week?":"หากข้อความนี้เป็นจริงเราควรเปลี่ยนพฤติกรรมอะไรในสัปดาห์นี้","Who will you tell this story to this week?":"คุณจะเล่าเรื่องนี้ให้กับใครในสัปดาห์นี้?","What needs can we meet in the community this week?":"สัปดาห์นี้เราสามารถตอบสนองความต้องการอะไรได้บ้าง?","When do you want to meet again?":"คุณต้องการพบกันอีกเมื่อไหร่?","Discovry Bible Study":"การศึกษาคัมภีร์ไบเบิล","Discus with Friends":"จานกับเพื่อน ๆ","Would you like to discover with your friends what God is like and how God want you to live?":"คุณต้องการค้นพบกับเพื่อนของคุณว่าพระเจ้าเป็นอย่างไรและพระเจ้าต้องการให้คุณมีชีวิตอยู่อย่างไร?","Here are some questions to get your discussion started.":"นี่คือคำถามบางอย่างเพื่อให้การสนทนาของคุณเริ่มต้นขึ้น","Read more":"อ่านเพิ่มเติม","Would you like to discover for yourself what God is like and how God want you to live?":"คุณต้องการค้นพบตัวเองว่าพระเจ้าเป็นอย่างไรและพระเจ้าต้องการให้คุณมีชีวิตอยู่อย่างไร?","Most people like to make these discoveries in a group with their friends.":"คนส่วนใหญ่ชอบที่จะค้นพบสิ่งเหล่านี้ในกลุ่มกับเพื่อนของพวกเขา","Read more\r":"อ่านเพิ่มเติม\r"}