{"Look Back":"Lumingon sa likod","Look Up":"Tumingin ka","Look Forward":"Asahan","What are you thankful for this week?":"Ano ang pasasalamat mo sa linggong ito?","What are you struggling with and how can we help?":"Ano ang pinaghirapan mo at paano tayo makakatulong?","How did you put into practice the scripture\/story we studied last time we met?":"Paano mo isinagawa ang Banal na Kasulatan\/kwento na pinag -aralan namin noong nakaraang oras na nakilala namin?","Who did you share last week's lesson with and how did it go?":"Sino ang ibinahagi mo noong nakaraang linggo at paano ito napunta?","What needs did you meet in the community last week?":"Ano ang mga pangangailangan na nakilala mo sa komunidad noong nakaraang linggo?","Ask someone to read the passage one paragraph at a time.":"Hilingin sa isang tao na basahin ang daanan ng isang talata nang paisa -isa.","Have a group member tell it in their own words.":"Magkaroon ng isang miyembro ng pangkat na sabihin ito sa kanilang sariling mga salita.","Ask the group if they added anything or left anything out.":"Tanungin ang grupo kung nagdagdag sila ng anuman o iniwan ang anumang bagay.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kapag natapos ka sa lahat ng mga talata, hilingin sa isang tao sa pangkat na sabihin ang buong kuwento ayon sa memorya. Itama ang pangkat ng anumang mga pagkakamali.","What does this passage tell us about God?":"Ano ang sinasabi sa atin ng talatang ito tungkol sa Diyos?","What does this passage tell us about people?":"Ano ang sinasabi sa amin ng talatang ito tungkol sa mga tao?","If this passage is true, what behaviour should we change this week?":"Kung ang talatang ito ay totoo, anong pag -uugali ang dapat nating baguhin sa linggong ito?","Who will you tell this story to this week?":"Sino ang sasabihin mo sa kuwentong ito sa linggong ito?","What needs can we meet in the community this week?":"Ano ang mga pangangailangan na maaari nating matugunan sa komunidad sa linggong ito?","When do you want to meet again?":"Kailan mo gustong magkita ulit?","Discovry Bible Study":"Pag -aaral ng Discovry Bibliya","Discus with Friends":"Discus sa mga kaibigan","Would you like to discover with your friends what God is like and how God want you to live?":"Nais mo bang matuklasan kasama ang iyong mga kaibigan kung ano ang Diyos at kung paano nais ng Diyos na mabuhay ka?","Here are some questions to get your discussion started.":"Narito ang ilang mga katanungan upang masimulan ang iyong talakayan.","Read more":"Magbasa pa","Would you like to discover for yourself what God is like and how God want you to live?":"Nais mo bang matuklasan para sa iyong sarili kung ano ang kagaya ng Diyos at kung paano nais mong mabuhay ang Diyos?","Most people like to make these discoveries in a group with their friends.":"Karamihan sa mga tao ay nais na gawin ang mga pagtuklas na ito sa isang pangkat kasama ang kanilang mga kaibigan.","Read more\r":"Magbasa pa\r"}