{"Look Back":"Tarisa kumashure","Look Up":"Tarisa mudenga","Look Forward":"Tarisira","What are you thankful for this week?":"Chii chaunotenda svondo rino?","What are you struggling with and how can we help?":"Chii chauri kunetseka nazvo uye isu tingabatsira sei?","How did you put into practice the scripture\/story we studied last time we met?":"Wakaisa sei mukuita rugwaro \/ nyaya yatakadzidza nguva yekupedzisira takasangana?","Who did you share last week's lesson with and how did it go?":"Wakagovana ndiani wakagovana chidzidzo chevhiki rapfuura uye zvakafamba sei?","What needs did you meet in the community last week?":"Ndezvipi zvinodiwa zvaunosangana navo munharaunda svondo rapfuura?","Ask someone to read the passage one paragraph at a time.":"Kumbira mumwe munhu kuti averenge ndima imwe chete panguva.","Have a group member tell it in their own words.":"Ita kuti nhengo yeboka iudze mumashoko avo.","Ask the group if they added anything or left anything out.":"Bvunza boka kana vakawedzera chero chinhu kana kusiiwa chero chinhu kunze.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Paunopedza nendima dzese, bvunza mumwe munhu muboka kuti ataure nyaya yese nenyaya. Ita kuti boka riruramise chero zvikanganiso.","What does this passage tell us about God?":"Ndima iyi inotiudzei nezvaMwari?","What does this passage tell us about people?":"Ndima iyi inotiudzei nezvevanhu?","If this passage is true, what behaviour should we change this week?":"Kana ndima iyi ichokwadi, maitiro api atinofanira kuchinja vhiki ino?","Who will you tell this story to this week?":"Ndiani uchaudza uyu nyaya vhiki ino?","What needs can we meet in the community this week?":"Ndezvipi zvinodiwa zvatingasangana munharaunda vhiki ino?","When do you want to meet again?":"Iwe unoda kusangana zvakare riini?","Discovry Bible Study":"Dzidziso Dzinodzora Bhaibheri","Discus with Friends":"Discus neshamwari","Would you like to discover with your friends what God is like and how God want you to live?":"Ungada kuwana neshamwari dzako izvo zvakaita Mwari uye kuti Mwari anoda kuti urarame sei?","Here are some questions to get your discussion started.":"Heano mimwe mibvunzo yekuita kuti hurukuro yako itange.","Read more":"Verenga zvimwe","Would you like to discover for yourself what God is like and how God want you to live?":"Ungada kuzviwanira iwe pachako izvo Mwari zvaakaita uye kuti Mwari anoda kuti urarame sei?","Most people like to make these discoveries in a group with their friends.":"Vanhu vazhinji vanofarira kuita izvi zviwanikwa muboka neshamwari dzavo.","Read more\r":"Verenga zvimwe\r"}