{"Look Back":"Orqaga nazar","Look Up":"Axtarish, izlash","Look Forward":"Kutib qolish","What are you thankful for this week?":"Ushbu hafta uchun nima uchun minnatdormisiz?","What are you struggling with and how can we help?":"Siz nima bilan kurashayapsiz va qanday yordam beramiz?","How did you put into practice the scripture\/story we studied last time we met?":"Siz oxirgi marta uchrashganmiz haqida yozilgan oyat \/ hikoya bilan shug'ullandingizmi?","Who did you share last week's lesson with and how did it go?":"O'tgan haftadagi darsni kim bilan u bilan baham ko'rdingiz va u qanday o'tdi?","What needs did you meet in the community last week?":"O'tgan haftada jamiyatda qanday ehtiyojlar bilan uchrashdingiz?","Ask someone to read the passage one paragraph at a time.":"Bir vaqtning o'zida bitta paragrafni o'qishni so'rang.","Have a group member tell it in their own words.":"Guruh a'zosi buni o'z so'zlarida ayting.","Ask the group if they added anything or left anything out.":"Guruhdan, agar ular hech narsa qo'shib yoki biron narsani qoldirsalar.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Siz barcha paragraflar bilan tugatgandan so'ng, guruhda kimdirdan butun voqeani xotira orqali aytib berishini so'rang. Guruh har qanday xatoga yo'l qo'ying.","What does this passage tell us about God?":"Bu parcha Xudo to'g'risida nima deydi?","What does this passage tell us about people?":"Ushbu parcha odamlar haqida nima deydi?","If this passage is true, what behaviour should we change this week?":"Agar bu paragraf to'g'ri bo'lsa, bu hafta qanday xatti-harakatni o'zgartirishimiz kerak?","Who will you tell this story to this week?":"Ushbu voqeani bu haftada kimni ayta olasiz?","What needs can we meet in the community this week?":"Bu hafta jamiyatda qanday ehtiyojlar bilan uchrashishimiz mumkin?","When do you want to meet again?":"Qachon yana uchrashishni xohlaysiz?","Discovry Bible Study":"Bibliyani o'rganish","Discus with Friends":"Do'stlar bilan disk","Would you like to discover with your friends what God is like and how God want you to live?":"Do'stlaringiz bilan Xudo qanday ekanligini va Xudo yashashingizni xohlayotganingizni bilishni xohlaysizmi?","Here are some questions to get your discussion started.":"Muhokamaingizni boshlash uchun ba'zi savollar mavjud.","Read more":"Ko'proq o'qish","Would you like to discover for yourself what God is like and how God want you to live?":"Xudo nima ekanligini va Xudo sizni qanday yashashingizni xohlayotganingizni bilib olasizmi?","Most people like to make these discoveries in a group with their friends.":"Aksariyat odamlar ushbu kashfiyotlarni do'stlari bilan guruhda qilishni yaxshi ko'radilar.","Read more\r":"Ko'proq o'qish\r"}