{"Look Back":"Погледни назад","Look Up":"Погледни нагоре","Look Forward":"Очакваме с нетърпение","What are you thankful for this week?":"За какво сте благодарни за тази седмица?","What are you struggling with and how can we help?":"С какво се борите и как можем да помогнем?","How did you put into practice the scripture\/story we studied last time we met?":"Как приложихте на практика Писанието\/историята, която изучихме последния път, когато се срещнахме?","Who did you share last week's lesson with and how did it go?":"С кого споделихте урока от миналата седмица и как мина?","What needs did you meet in the community last week?":"Какви нужди се срещнахте в общността миналата седмица?","Ask someone to read the passage one paragraph at a time.":"Помолете някой да прочете пасажа по един параграф наведнъж.","Have a group member tell it in their own words.":"Накарайте член на групата да го каже със собствени думи.","Ask the group if they added anything or left anything out.":"Попитайте групата дали са добавили нещо или са оставили нещо навън.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Когато приключите с всички параграфи, помолете някой от групата да разкаже цялата история по памет. Накарайте групата да коригира грешки.","What does this passage tell us about God?":"Какво ни казва този пасаж за Бог?","What does this passage tell us about people?":"Какво ни казва този пасаж за хората?","If this passage is true, what behaviour should we change this week?":"Ако този пасаж е истина, какво поведение трябва да променим тази седмица?","Who will you tell this story to this week?":"Кого ще разкажете тази история на тази седмица?","What needs can we meet in the community this week?":"Какви нужди можем да се срещнем в общността тази седмица?","When do you want to meet again?":"Кога искате да се срещнете отново?","Discovry Bible Study":"Discovry Bible Study","Discus with Friends":"Обсъждане с приятели","Would you like to discover with your friends what God is like and how God want you to live?":"Искате ли да откриете с приятелите си какъв е Бог и как Бог иска да живеете?","Here are some questions to get your discussion started.":"Ето няколко въпроса, за да започнете дискусията си.","Read more":"Прочетете още","Would you like to discover for yourself what God is like and how God want you to live?":"Бихте ли искали да откриете сами какъв е Бог и как Бог иска да живеете?","Most people like to make these discoveries in a group with their friends.":"Повечето хора обичат да правят тези открития в група с приятелите си.","Read more\r":"Прочетете още\r"}