{"Look Back":"Obzrieť sa","Look Up":"Vyhľadať","Look Forward":"Tešiť sa","What are you thankful for this week?":"Za čo ste vďační za tento týždeň?","What are you struggling with and how can we help?":"S čím bojujete a ako môžeme pomôcť?","How did you put into practice the scripture\/story we studied last time we met?":"Ako ste zaviedli do praxe Písmo\/príbeh, ktorý sme študovali naposledy, keď sme sa stretli?","Who did you share last week's lesson with and how did it go?":"S kým ste zdieľali minulý týždeň lekciu a ako to šlo?","What needs did you meet in the community last week?":"Aké potreby ste splnili v komunite minulý týždeň?","Ask someone to read the passage one paragraph at a time.":"Požiadajte niekoho, aby si prečítal priechod jeden odsek naraz.","Have a group member tell it in their own words.":"Nechajte to člena skupiny povedať svojimi vlastnými slovami.","Ask the group if they added anything or left anything out.":"Opýtajte sa skupiny, či niečo pridali alebo niečo vynechali.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Keď skončíte so všetkými odsekmi, požiadajte niekoho v skupine, aby rozprával celý príbeh podľa pamäti. Nechajte skupinu opraviť akékoľvek chyby.","What does this passage tell us about God?":"Čo nám táto pasáž hovorí o Bohu?","What does this passage tell us about people?":"Čo nám táto pasáž hovorí o ľuďoch?","If this passage is true, what behaviour should we change this week?":"Ak je táto pasáž pravdivá, aké správanie by sme mali tento týždeň zmeniť?","Who will you tell this story to this week?":"Koho rozprávate tento príbeh do tohto týždňa?","What needs can we meet in the community this week?":"Aké potreby môžeme tento týždeň splniť v komunite?","When do you want to meet again?":"Kedy sa chcete znova stretnúť?","Discovry Bible Study":"Discovry Biblia štúdia","Discus with Friends":"Discus s priateľmi","Would you like to discover with your friends what God is like and how God want you to live?":"Chceli by ste objaviť so svojimi priateľmi, aký je Boh a ako Boh chce, aby ste žili?","Here are some questions to get your discussion started.":"Tu je niekoľko otázok, ako začať vašu diskusiu.","Read more":"Čítaj viac","Would you like to discover for yourself what God is like and how God want you to live?":"Chceli by ste pre seba zistiť, aký je Boh a ako Boh chce, aby ste žili?","Most people like to make these discoveries in a group with their friends.":"Väčšina ľudí rád robí tieto objavy v skupine so svojimi priateľmi.","Read more\r":"Čítaj viac\r"}