{"Look Back":"திரும்பி பார்","Look Up":"பாருங்கள்","Look Forward":"எதிர்நோக்குங்கள்","What are you thankful for this week?":"இந்த வாரத்திற்கு நீங்கள் என்ன நன்றி செலுத்துகிறீர்கள்?","What are you struggling with and how can we help?":"நீங்கள் எதுடன் போராடுகிறீர்கள், நாங்கள் எவ்வாறு உதவ முடியும்?","How did you put into practice the scripture\/story we studied last time we met?":"கடைசியாக நாங்கள் சந்தித்தபோது நாங்கள் படித்த வேதம்\/கதையை நீங்கள் எவ்வாறு நடைமுறைக்கு வைத்தீர்கள்?","Who did you share last week's lesson with and how did it go?":"கடந்த வார பாடத்தை நீங்கள் யாருடன் பகிர்ந்து கொண்டீர்கள், அது எப்படி சென்றது?","What needs did you meet in the community last week?":"கடந்த வாரம் சமூகத்தில் என்ன தேவைகள் பூர்த்தி செய்தன?","Ask someone to read the passage one paragraph at a time.":"ஒரு நேரத்தில் ஒரு பத்தியை பத்தியில் படிக்க யாரையாவது கேளுங்கள்.","Have a group member tell it in their own words.":"ஒரு குழு உறுப்பினர் அதை தங்கள் சொந்த வார்த்தைகளில் சொல்லுங்கள்.","Ask the group if they added anything or left anything out.":"அவர்கள் எதையும் சேர்த்தால் அல்லது எதையும் விட்டுவிட்டால் குழுவிடம் கேளுங்கள்.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"எல்லா பத்திகளுடனும் நீங்கள் முடிக்கும்போது, குழுவில் உள்ள ஒருவரிடம் முழு கதையையும் நினைவகத்தால் சொல்லச் சொல்லுங்கள். குழு ஏதேனும் பிழைகளை சரிசெய்ய வேண்டும்.","What does this passage tell us about God?":"இந்த பத்தியில் கடவுளைப் பற்றி என்ன சொல்கிறது?","What does this passage tell us about people?":"இந்த பத்தியில் மக்களைப் பற்றி என்ன சொல்கிறது?","If this passage is true, what behaviour should we change this week?":"இந்த பத்தியில் உண்மையாக இருந்தால், இந்த வாரம் நாம் என்ன நடத்தை மாற்ற வேண்டும்?","Who will you tell this story to this week?":"இந்த வாரத்திற்கு இந்த கதையை யார் சொல்வீர்கள்?","What needs can we meet in the community this week?":"இந்த வாரம் சமூகத்தில் நாம் என்ன சந்திக்க முடியும்?","When do you want to meet again?":"நீங்கள் எப்போது மீண்டும் சந்திக்க விரும்புகிறீர்கள்?","Discovry Bible Study":"டிஸ்கோவ்ரி பைபிள் படிப்பு","Discus with Friends":"நண்பர்களுடன் டிஸ்கஸ்","Would you like to discover with your friends what God is like and how God want you to live?":"கடவுள் எப்படி இருக்கிறார், நீங்கள் எப்படி வாழ வேண்டும் என்று கடவுள் விரும்புகிறார் என்பதை உங்கள் நண்பர்களுடன் கண்டுபிடிக்க விரும்புகிறீர்களா?","Here are some questions to get your discussion started.":"உங்கள் விவாதத்தைத் தொடங்க சில கேள்விகள் இங்கே.","Read more":"மேலும் வாசிக்க","Would you like to discover for yourself what God is like and how God want you to live?":"கடவுள் எப்படி இருக்கிறார், நீங்கள் எப்படி வாழ வேண்டும் என்று கடவுள் விரும்புகிறார் என்பதை நீங்களே கண்டுபிடிக்க விரும்புகிறீர்களா?","Most people like to make these discoveries in a group with their friends.":"பெரும்பாலான மக்கள் இந்த கண்டுபிடிப்புகளை தங்கள் நண்பர்களுடன் ஒரு குழுவில் செய்ய விரும்புகிறார்கள்.","Read more\r":"மேலும் வாசிக்க\r"}