{"Look Back":"להסתכל אחורה","Look Up":"הבט מעלה","Look Forward":"הסתכל קדימה","What are you thankful for this week?":"מה אתה אסיר תודה על השבוע הזה?","What are you struggling with and how can we help?":"עם מה אתה נאבק ואיך אנחנו יכולים לעזור?","How did you put into practice the scripture\/story we studied last time we met?":"איך הפקת את הכתובים\/הסיפור שלמדנו בפעם האחרונה שפגשנו?","Who did you share last week's lesson with and how did it go?":"עם מי חלקת את השיעור בשבוע שעבר ואיך זה הלך?","What needs did you meet in the community last week?":"אילו צרכים עמדת בקהילה בשבוע שעבר?","Ask someone to read the passage one paragraph at a time.":"בקש ממישהו לקרוא את הקטע פסקה אחת בכל פעם.","Have a group member tell it in their own words.":"בקש מחבר קבוצה לספר את זה במילים שלהם.","Ask the group if they added anything or left anything out.":"שאל את הקבוצה אם הם הוסיפו משהו או השאירו משהו בחוץ.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"כשאתה מסיים עם כל הפסקאות, בקש ממישהו בקבוצה לספר את כל הסיפור לפי זיכרון. בקש מהקבוצה לתקן שגיאות כלשהן.","What does this passage tell us about God?":"מה הקטע הזה אומר לנו על אלוהים?","What does this passage tell us about people?":"מה הקטע הזה אומר לנו על אנשים?","If this passage is true, what behaviour should we change this week?":"אם הקטע הזה נכון, איזו התנהגות עלינו לשנות השבוע?","Who will you tell this story to this week?":"למי תספר את הסיפור הזה השבוע?","What needs can we meet in the community this week?":"באילו צרכים נוכל לעמוד בקהילה השבוע?","When do you want to meet again?":"מתי אתה רוצה להיפגש שוב?","Discovry Bible Study":"לימוד התנ\"ך לשחרור","Discus with Friends":"דיסקוס עם חברים","Would you like to discover with your friends what God is like and how God want you to live?":"האם תרצה לגלות עם חבריך איך אלוהים ואיך אלוהים רוצה שתחיה?","Here are some questions to get your discussion started.":"להלן כמה שאלות כדי להתחיל את הדיון שלך.","Read more":"קרא עוד","Would you like to discover for yourself what God is like and how God want you to live?":"האם תרצה לגלות בעצמך איך אלוהים ואיך אלוהים רוצה שתחיה?","Most people like to make these discoveries in a group with their friends.":"רוב האנשים אוהבים לגלות את התגליות הללו בקבוצה עם חבריהם.","Read more\r":"קרא עוד\r"}