{"Look Back":"Zréck kucken","Look Up":"Eropkucken","Look Forward":"Sech op eppes freeën","What are you thankful for this week?":"Wat sidd Dir Merci fir dës Woch?","What are you struggling with and how can we help?":"Wat kämpft Dir mat a wéi kënne mir hëllefen?","How did you put into practice the scripture\/story we studied last time we met?":"Wéi hutt Dir d'Skriptur \/ Geschicht ageriicht, déi mir déi leschte Kéier studéiert hunn, hu mir eis getraff?","Who did you share last week's lesson with and how did it go?":"Mat wiem hutt Dir d'lescht Woch Lektioun matgedeelt a wéi ass et gaang?","What needs did you meet in the community last week?":"Wat brauch Dir an der Aarbechtszäit déi lescht Woch an der Gemeinschaft treffen?","Ask someone to read the passage one paragraph at a time.":"Froen een de Passage ee Paragraf gläichzäiteg ze liesen.","Have a group member tell it in their own words.":"Hunn e Gruppemember deen et an hiren eegene Wierder erzielt.","Ask the group if they added anything or left anything out.":"Frot de Grupp wann se eppes derbäigesat oder eppes gelooss hunn.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Wann Dir mat all Paragrafen fäerdeg hutt, frot een an der Grupp fir déi ganz Geschicht ze erzielen. Hunn de Grupp eng Feeler richteg.","What does this passage tell us about God?":"Wat seet dëse Passage eis iwwer Gott?","What does this passage tell us about people?":"Wat seet dëse Passage eis iwwer d'Leit?","If this passage is true, what behaviour should we change this week?":"Wann dëse Passage stëmmt, wéi eng Behuelen solle mir dës Woch änneren?","Who will you tell this story to this week?":"Wien seet Dir dës Geschicht op dës Woch?","What needs can we meet in the community this week?":"Wat brauche kënne mir eis Woch an der Gemeinschaft treffen?","When do you want to meet again?":"Wéini wëll Dir erëm treffen?","Discovry Bible Study":"Discover Bibelstudie","Discus with Friends":"Diskus mat Frënn","Would you like to discover with your friends what God is like and how God want you to live?":"Géift Dir mat Äre Frënn mat Äre Frënn entdecken, wéi Gott ass wéi Gott ass a wéi Gott wëllt Dir wunnen?","Here are some questions to get your discussion started.":"Hei sinn e puer Froen fir Är Diskussioun ugefaang ze kréien.","Read more":"Liest méi","Would you like to discover for yourself what God is like and how God want you to live?":"Wëllt Dir Iech selwer entdecken wat, wat Gott as, wéi Gott Dir wunnt?","Most people like to make these discoveries in a group with their friends.":"Déi meescht Leit gär dës Entdeckungen an engem Grupp mat hire Frënn ze maachen.","Read more\r":"Liest méi\r"}