{"Look Back":"Subiza amaso inyuma","Look Up":"Reba hejuru","Look Forward":"Reba imbere","What are you thankful for this week?":"Ni iki ushimira muri iki cyumweru?","What are you struggling with and how can we help?":"Urarwana niki kandi twafasha dute?","How did you put into practice the scripture\/story we studied last time we met?":"Nigute washyize mubikorwa ibyanditswe \/ inkuru twaze igihe cyashize duhura?","Who did you share last week's lesson with and how did it go?":"Ninde wasangiye isomo ryicyumweru cyicyumweru kandi byagenze bite?","What needs did you meet in the community last week?":"Ni ibihe bikenewe wahuye nayi mu cyumweru gishize?","Ask someone to read the passage one paragraph at a time.":"Saba umuntu gusoma igice igika kimwe icyarimwe.","Have a group member tell it in their own words.":"Gira abagize itsinda ubibwire mumagambo yabo.","Ask the group if they added anything or left anything out.":"Baza itsinda niba bongeyeho cyangwa basize ikintu na kimwe.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Iyo urangije hamwe nibika byose, baza umuntu mumatsinda kuvuga inkuru yose hibuka. Saba itsinda gukosora amakosa yose.","What does this passage tell us about God?":"Iki gice kitubwira iki ku Mana?","What does this passage tell us about people?":"Iki gice kitubwira iki kubantu?","If this passage is true, what behaviour should we change this week?":"Niba iki gice ari ukuri, niyihe myitwarire tugomba guhinduka muri iki cyumweru?","Who will you tell this story to this week?":"Ninde uzabwira iyi nkuru muri iki cyumweru?","What needs can we meet in the community this week?":"Ni ibihe bikenewe dushobora guterana mu baturage muri iki cyumweru?","When do you want to meet again?":"Ni ryari ushaka kongera guhura?","Discovry Bible Study":"Discovry Kwiga Bibiliya","Discus with Friends":"Kureka inshuti","Would you like to discover with your friends what God is like and how God want you to live?":"Urashaka kuvumbura hamwe ninshuti zawe icyo Imana imeze nuburyo Imana ishaka ko ubaho?","Here are some questions to get your discussion started.":"Hano haribibazo bimwe kugirango ibiganiro byawe bitangire.","Read more":"Soma byinshi","Would you like to discover for yourself what God is like and how God want you to live?":"Urashaka kuvumbura ubwawe kubyo Imana imeze nuburyo Imana ishaka ko ubaho?","Most people like to make these discoveries in a group with their friends.":"Abantu benshi bakunda gukora ubwo buvumbuzi mumatsinda hamwe ninshuti zabo.","Read more\r":"Soma byinshi\r"}