{"Look Back":"קוק צוריק","Look Up":"קוק אַרויף","Look Forward":"קוק פאָרויס","What are you thankful for this week?":"וואָס זענען איר דאַנקבאַר פֿאַר די וואָך?","What are you struggling with and how can we help?":"וואָס זענען איר סטראַגאַלינג מיט און ווי קענען מיר העלפֿן?","How did you put into practice the scripture\/story we studied last time we met?":"ווי האָט איר שטעלן אין פיר די פסוק \/ דערציילונג מיר געלערנט לעצטע מאָל מיר באגעגנט?","Who did you share last week's lesson with and how did it go?":"וואָס האָט איר טיילן די לעקציע פון די לעצטע וואָך און ווי עס איז געווען?","What needs did you meet in the community last week?":"וואָס דאַרף איר טרעפן אין די קהל לעצטע וואָך?","Ask someone to read the passage one paragraph at a time.":"פרעגן עמעצער צו לייענען די דורכפאָר פון איין פּאַראַגראַף אין אַ מאָל.","Have a group member tell it in their own words.":"האָבן אַ גרופּע מיטגליד זאָגן עס אין זייער אייגן ווערטער.","Ask the group if they added anything or left anything out.":"פרעגן די גרופּע אויב זיי צוגעגעבן עפּעס אָדער לינקס עפּעס.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"ווען איר ענדיקן מיט אַלע פּאַראַגראַפס, פרעגן עמעצער אין דער גרופּע צו זאָגן די גאנצע געשיכטע דורך זיקאָרן. האָבן די גרופּע ריכטיק ערראָרס.","What does this passage tell us about God?":"וואָס קען דער דורכפאָר דערציילן אונדז וועגן גאָט?","What does this passage tell us about people?":"וואָס טוט דעם דורכפאָר דערציילן אונדז וועגן מענטשן?","If this passage is true, what behaviour should we change this week?":"אויב דאָס דורכפאָר איז אמת, וואָס נאַטור זאָל מיר טוישן די וואָך?","Who will you tell this story to this week?":"וועמען וועט איר זאָגן דעם דערציילונג צו די וואָך?","What needs can we meet in the community this week?":"וואָס דאַרף מיר טרעפן אין די קהל די וואָך?","When do you want to meet again?":"ווען טאָן איר ווילן צו טרעפן ווידער?","Discovry Bible Study":"דיסקאָוורי ביבל לערנען","Discus with Friends":"דיסקוס מיט פרענדז","Would you like to discover with your friends what God is like and how God want you to live?":"וואָלט איר ווי צו אַנטדעקן מיט דיין פרענדז וואָס גאָט איז ווי און ווי גאָט וועלן איר צו לעבן?","Here are some questions to get your discussion started.":"דאָ זענען עטלעכע פֿראגן צו באַקומען דיין דיסקוסיע סטאַרטעד.","Read more":"לייענען מער","Would you like to discover for yourself what God is like and how God want you to live?":"וואָלט איר ווי צו אַנטדעקן זיך וואָס גאָט איז ווי און ווי גאָט וועלן איר צו לעבן?","Most people like to make these discoveries in a group with their friends.":"רובֿ מענטשן ווי צו מאַכן די דיסקאַוועריז אין אַ גרופּע מיט זייער פרענדז.","Read more\r":"לייענען מער\r"}