{"Look Back":"振り返る","Look Up":"見上げる","Look Forward":"楽しみにする","What are you thankful for this week?":"今週は何に感謝していますか？","What are you struggling with and how can we help?":"あなたは何に苦労していますか、そして私たちはどのように助けることができますか？","How did you put into practice the scripture\/story we studied last time we met?":"前回出会ったときに勉強した聖書\/物語をどのように実践しましたか？","Who did you share last week's lesson with and how did it go?":"先週のレッスンを誰と共有しましたか、そしてそれはどのように進みましたか？","What needs did you meet in the community last week?":"先週コミュニティでどのようなニーズに会いましたか？","Ask someone to read the passage one paragraph at a time.":"誰かに一度に1つの段落を読むように頼みます。","Have a group member tell it in their own words.":"グループメンバーに自分の言葉でそれを伝えさせてください。","Ask the group if they added anything or left anything out.":"グループに何かを追加するか、何かを除外したかどうかを尋ねます。","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"すべての段落で終了したら、グループ内の誰かに記憶によってストーリー全体を伝えるように依頼してください。グループにエラーを修正させます。","What does this passage tell us about God?":"この一節は神について何を教えてくれますか？","What does this passage tell us about people?":"この一節は人々について何を教えてくれますか？","If this passage is true, what behaviour should we change this week?":"この一節が真実なら、今週はどのような行動を変えるべきですか？","Who will you tell this story to this week?":"今週にこの話をしますか？","What needs can we meet in the community this week?":"今週、コミュニティでどのようなニーズを満たすことができますか？","When do you want to meet again?":"いつまた会いたいですか？","Discovry Bible Study":"聖書研究","Discus with Friends":"友達との円盤投げ","Would you like to discover with your friends what God is like and how God want you to live?":"あなたはあなたの友人と一緒に神がどのようなものであり、どのように神があなたに生きたいと思っているかをあなたの友人と知りたいですか？","Here are some questions to get your discussion started.":"議論を開始するためのいくつかの質問があります。","Read more":"続きを読む","Would you like to discover for yourself what God is like and how God want you to live?":"あなたは自分自身のために、神がどのようなものであり、神があなたに生きたいと思っていることを自分で発見したいですか？","Most people like to make these discoveries in a group with their friends.":"ほとんどの人は、友人とグループでこれらの発見をするのが好きです。","Read more\r":"続きを読む\r"}