{"Look Back":"തിരിഞ്ഞുനോക്കുക","Look Up":"തിരയൽ","Look Forward":"മുന്നോട്ട് നോക്കുക","What are you thankful for this week?":"ഈ ആഴ്ചയിൽ നിങ്ങൾ എന്താണ് നന്ദി പറയുന്നത്?","What are you struggling with and how can we help?":"നിങ്ങൾ എന്തിനാണ് ബുദ്ധിമുട്ടുള്ളത്, നമുക്ക് എങ്ങനെ സഹായിക്കാനാകും?","How did you put into practice the scripture\/story we studied last time we met?":"ഞങ്ങൾ കഴിഞ്ഞ തവണ ഞങ്ങൾ പഠിച്ച തിരുവെഴുത്ത് \/ കഥയെ നിങ്ങൾ പരിശീലിച്ചതെങ്ങനെ?","Who did you share last week's lesson with and how did it go?":"അവസാന ആഴ്ചയുടെ പാഠം നിങ്ങൾ ആരെയാണ് പങ്കുവെച്ചത്, അത് എങ്ങനെ പോയി?","What needs did you meet in the community last week?":"കഴിഞ്ഞയാഴ്ച കമ്മ്യൂണിറ്റിയിൽ നിങ്ങൾ എന്താണ് കണ്ടുമുട്ടിയത്?","Ask someone to read the passage one paragraph at a time.":"ഒരു സമയം ഒരു ഖണ്ഡിക ഒരു ഖണ്ഡിക വായിക്കാൻ ആരോടെങ്കിലും ആവശ്യപ്പെടുക.","Have a group member tell it in their own words.":"ഒരു ഗ്രൂപ്പ് അംഗം അത് അവരുടെ സ്വന്തം വാക്കുകളിൽ പറയുന്നു.","Ask the group if they added anything or left anything out.":"അവ എന്തും ചേർക്കുകയോ അതിൽ നിന്ന് ഒന്നും ഉപേക്ഷിക്കുകയോ ചെയ്താൽ ഗ്രൂപ്പ് ചോദിക്കുക.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"നിങ്ങൾ എല്ലാ ഖണ്ഡികകളും പൂർത്തിയാക്കുമ്പോൾ, ഓർമ്മയിലൂടെ മുഴുവൻ കഥയും പറയാൻ ഗ്രൂപ്പിലെ ആരോടെങ്കിലും ചോദിക്കുക. ഗ്രൂപ്പ് ഏതെങ്കിലും പിശകുകൾ ശരിയാക്കുക.","What does this passage tell us about God?":"ഈ ഭാഗം ദൈവത്തെക്കുറിച്ച് എന്താണ് പറയുന്നത്?","What does this passage tell us about people?":"ഈ ഭാഗം ആളുകളെക്കുറിച്ച് എന്താണ് പറയുന്നത്?","If this passage is true, what behaviour should we change this week?":"ഈ ഭാഗം ശരിയാണെങ്കിൽ, ഈ ആഴ്ച ഞങ്ങൾ എന്ത് പെരുമാറ്റമാണ് മാറ്റം വരുത്തേണ്ടത്?","Who will you tell this story to this week?":"ഈ ആഴ്ച നിങ്ങൾ ആരാണ് ഈ കഥ പറയുന്നത്?","What needs can we meet in the community this week?":"ഈ ആഴ്ച കമ്മ്യൂണിറ്റിയിൽ നമുക്ക് എന്ത് ആവശ്യമാണ്?","When do you want to meet again?":"എപ്പോഴാണ് നിങ്ങൾ വീണ്ടും കണ്ടുമുട്ടാൻ ആഗ്രഹിക്കുന്നത്?","Discovry Bible Study":"ബൈബിൾ പഠനം നിരസിക്കുക","Discus with Friends":"ചങ്ങാതിമാരുമായി ഡിസ്കസ് ചെയ്യുക","Would you like to discover with your friends what God is like and how God want you to live?":"ദൈവം എങ്ങനെയുള്ളതും ദൈവം നിങ്ങൾ എങ്ങനെ ജീവിക്കണമെന്നും നിങ്ങളുടെ ചങ്ങാതിമാരുമായി കണ്ടെത്താൻ നിങ്ങൾ ആഗ്രഹിക്കുന്നുണ്ടോ?","Here are some questions to get your discussion started.":"നിങ്ങളുടെ ചർച്ച ആരംഭിക്കുന്നതിന് ചില ചോദ്യങ്ങൾ ഇതാ.","Read more":"കൂടുതൽ വായിക്കുക","Would you like to discover for yourself what God is like and how God want you to live?":"ദൈവം എങ്ങനെയുള്ളതും ദൈവം എങ്ങനെയാണെന്നും നിങ്ങൾ എങ്ങനെ ജീവിക്കണമെന്നും നിങ്ങൾ സ്വയം കണ്ടെത്തുന്നത് നിങ്ങൾ ആഗ്രഹിക്കുന്നുണ്ടോ?","Most people like to make these discoveries in a group with their friends.":"മിക്ക ആളുകളും അവരുടെ സുഹൃത്തുക്കളുമായുള്ള ഒരു ഗ്രൂപ്പിൽ ഈ കണ്ടെത്തലുകൾ നടത്താൻ ഇഷ്ടപ്പെടുന്നു.","Read more\r":"കൂടുതൽ വായിക്കുക\r"}