{"Look Back":"Melihat ke belakang","Look Up":"Lihatlah","Look Forward":"Melihat ke depan","What are you thankful for this week?":"Apa yang Anda syukuri minggu ini?","What are you struggling with and how can we help?":"Apa yang Anda perjuangkan dan bagaimana kami bisa membantu?","How did you put into practice the scripture\/story we studied last time we met?":"Bagaimana Anda mempraktikkan tulisan suci\/cerita yang kami pelajari terakhir kali kami bertemu?","Who did you share last week's lesson with and how did it go?":"Dengan siapa Anda berbagi pelajaran minggu lalu dan bagaimana hasilnya?","What needs did you meet in the community last week?":"Apa kebutuhan yang Anda temui di komunitas minggu lalu?","Ask someone to read the passage one paragraph at a time.":"Minta seseorang untuk membaca bagian satu paragraf sekaligus.","Have a group member tell it in their own words.":"Mintalah seorang anggota kelompok menceritakannya dengan kata -kata mereka sendiri.","Ask the group if they added anything or left anything out.":"Tanyakan kepada grup apakah mereka menambahkan sesuatu atau meninggalkan sesuatu.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Ketika Anda selesai dengan semua paragraf, mintalah seseorang di grup untuk menceritakan keseluruhan cerita dengan memori. Mintalah grup memperbaiki kesalahan apa pun.","What does this passage tell us about God?":"Apa yang dikatakan perikop ini tentang Tuhan?","What does this passage tell us about people?":"Apa yang dikatakan perikop ini tentang orang lain?","If this passage is true, what behaviour should we change this week?":"Jika bagian ini benar, perilaku apa yang harus kita ubah minggu ini?","Who will you tell this story to this week?":"Siapa yang akan Anda ceritakan kisah ini untuk minggu ini?","What needs can we meet in the community this week?":"Apa kebutuhan yang bisa kita temui di komunitas minggu ini?","When do you want to meet again?":"Kapan Anda ingin bertemu lagi?","Discovry Bible Study":"Pelajaran Alkitab Discovry","Discus with Friends":"Diskus dengan teman","Would you like to discover with your friends what God is like and how God want you to live?":"Apakah Anda ingin menemukan dengan teman -teman Anda seperti apa Tuhan itu dan bagaimana Tuhan ingin Anda hidup?","Here are some questions to get your discussion started.":"Berikut adalah beberapa pertanyaan untuk memulai diskusi Anda.","Read more":"Baca selengkapnya","Would you like to discover for yourself what God is like and how God want you to live?":"Apakah Anda ingin menemukan sendiri seperti apa Tuhan itu dan bagaimana Tuhan ingin Anda hidup?","Most people like to make these discoveries in a group with their friends.":"Kebanyakan orang suka membuat penemuan ini dalam kelompok dengan teman -teman mereka.","Read more\r":"Baca selengkapnya\r"}