{"Look Back":"უკან დახედე","Look Up":"Მოძებნა, აიხედე ზემოთ","Look Forward":"Წინ იყურე","What are you thankful for this week?":"რა მადლობას გიხდით ამ კვირისთვის?","What are you struggling with and how can we help?":"რას ებრძვით და როგორ შეგვიძლია დაგეხმაროთ?","How did you put into practice the scripture\/story we studied last time we met?":"როგორ გამოიყენეთ პრაქტიკა წმინდა წერილში\/ამბავი, რომელიც ჩვენ შევისწავლეთ ბოლო დროს, როდესაც შევხვდით?","Who did you share last week's lesson with and how did it go?":"ვის გაგიზიარეთ გასული კვირის გაკვეთილი და როგორ წავიდა?","What needs did you meet in the community last week?":"რა საჭიროებებით შეხვდით საზოგადოებაში გასულ კვირას?","Ask someone to read the passage one paragraph at a time.":"სთხოვეთ ვინმეს წაიკითხოს პასაჟი ერთი აბზაცის ერთდროულად.","Have a group member tell it in their own words.":"ჯგუფის წევრს ეს სიტყვებით უთხრას.","Ask the group if they added anything or left anything out.":"ჰკითხეთ ჯგუფს, დაამატეს რამე, ან დატოვეს რამე.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"როდესაც ყველა აბზაცს დაასრულებთ, ჯგუფში სთხოვეთ ვინმეს, რომ მთლიანი ამბავი მოგვითხრობს. ჯგუფს შეასწორეთ შეცდომები.","What does this passage tell us about God?":"რას გვეუბნება ეს პასაჟი ღმერთზე?","What does this passage tell us about people?":"რას გვეუბნება ეს პასაჟი ხალხზე?","If this passage is true, what behaviour should we change this week?":"თუ ეს პასაჟი მართალია, რა ქცევა უნდა შევცვალოთ ამ კვირაში?","Who will you tell this story to this week?":"ვის მოუყვებით ამ ამბავს ამ კვირაში?","What needs can we meet in the community this week?":"რა საჭიროებები შეგვიძლია ამ კვირაში საზოგადოებაში?","When do you want to meet again?":"როდის გინდა ისევ შეხვედრა?","Discovry Bible Study":"ბიბლიის შესწავლა","Discus with Friends":"იმედგაცრუება მეგობრებთან ერთად","Would you like to discover with your friends what God is like and how God want you to live?":"გსურთ იპოვოთ თქვენს მეგობრებთან ერთად როგორია ღმერთი და როგორ სურს ღმერთმა იცხოვროთ?","Here are some questions to get your discussion started.":"აქ მოცემულია რამდენიმე კითხვა, რომ თქვენი დისკუსიის დასაწყებად.","Read more":"Წაიკითხე მეტი","Would you like to discover for yourself what God is like and how God want you to live?":"გსურთ საკუთარი თავისთვის აღმოაჩინოთ, როგორია ღმერთი და როგორ სურს ღმერთმა იცხოვროთ?","Most people like to make these discoveries in a group with their friends.":"ადამიანების უმეტესობას მოსწონს ამ აღმოჩენების გაკეთება ჯგუფში მეგობრებთან ერთად.","Read more\r":"Წაიკითხე მეტი\r"}