{"Look Back":"Poglej nazaj","Look Up":"Poglej gor","Look Forward":"Veselim se naprej","What are you thankful for this week?":"Kaj ste hvaležni za ta teden?","What are you struggling with and how can we help?":"S čim se spopadate in kako lahko pomagamo?","How did you put into practice the scripture\/story we studied last time we met?":"Kako ste uresničili Sveto pismo\/zgodbo, ki smo jo študirali zadnjič, ko smo se srečali?","Who did you share last week's lesson with and how did it go?":"S kom ste delili lekcijo prejšnji teden in kako je šlo?","What needs did you meet in the community last week?":"Kaj ste se v skupnosti srečali prejšnji teden?","Ask someone to read the passage one paragraph at a time.":"Prosite nekoga, naj prebere en odstavek naenkrat.","Have a group member tell it in their own words.":"Naj to pove po svojih besedah.","Ask the group if they added anything or left anything out.":"Vprašajte skupino, če so kaj dodali ali izpustili.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Ko končate z vsemi odstavki, prosite nekoga v skupini, da po spominu pove celotno zgodbo. Naj skupina popravi kakršne koli napake.","What does this passage tell us about God?":"Kaj nam ta odlomek pove o Bogu?","What does this passage tell us about people?":"Kaj nam ta odlomek pove o ljudeh?","If this passage is true, what behaviour should we change this week?":"Če je ta odlomek resničen, kakšno vedenje bi morali spremeniti ta teden?","Who will you tell this story to this week?":"Komu boste povedali v tem tednu?","What needs can we meet in the community this week?":"Kaj se lahko ta teden zadovoljimo v skupnosti?","When do you want to meet again?":"Kdaj se želite spet srečati?","Discovry Bible Study":"Odkrito biblijsko študijo","Discus with Friends":"Diskusi s prijatelji","Would you like to discover with your friends what God is like and how God want you to live?":"Bi radi s prijatelji odkrili, kakšni je Bog in kako Bog želi, da živite?","Here are some questions to get your discussion started.":"Tu je nekaj vprašanj, da začnete razpravo.","Read more":"Preberi več","Would you like to discover for yourself what God is like and how God want you to live?":"Bi radi odkrili, kakšni je Bog in kako Bog želi, da živite?","Most people like to make these discoveries in a group with their friends.":"Večina ljudi radi te odkritja v skupini s prijatelji.","Read more\r":"Preberi več\r"}