{"Look Back":"Mirar atrás","Look Up":"Buscar","Look Forward":"Esperar","What are you thankful for this week?":"¿Por qué estás agradecido esta semana?","What are you struggling with and how can we help?":"¿Con qué estás luchando y cómo podemos ayudar?","How did you put into practice the scripture\/story we studied last time we met?":"¿Cómo pusiste en práctica la Escritura\/Historia que estudiamos la última vez que nos conocimos?","Who did you share last week's lesson with and how did it go?":"¿Con quién compartiste la lección de la semana pasada y cómo fue?","What needs did you meet in the community last week?":"¿Qué necesidades conociste en la comunidad la semana pasada?","Ask someone to read the passage one paragraph at a time.":"Pídale a alguien que lea el pasaje un párrafo a la vez.","Have a group member tell it in their own words.":"Haga que un miembro del grupo lo cuente en sus propias palabras.","Ask the group if they added anything or left anything out.":"Pregúntele al grupo si agregaron algo o dejaron algo.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Cuando termine con todos los párrafos, pídale a alguien del grupo que cuente toda la historia por memoria. Haga que el grupo corrija cualquier error.","What does this passage tell us about God?":"¿Qué nos dice este pasaje sobre Dios?","What does this passage tell us about people?":"¿Qué nos dice este pasaje sobre las personas?","If this passage is true, what behaviour should we change this week?":"Si este pasaje es cierto, ¿qué comportamiento deberíamos cambiar esta semana?","Who will you tell this story to this week?":"¿A quién le contarás esta historia esta semana?","What needs can we meet in the community this week?":"¿Qué necesidades podemos conocer en la comunidad esta semana?","When do you want to meet again?":"¿Cuándo quieres volver a encontrarte?","Discovry Bible Study":"Estudio de la Biblia de Discovry","Discus with Friends":"Disco con amigos","Would you like to discover with your friends what God is like and how God want you to live?":"¿Le gustaría descubrir con sus amigos cómo es Dios y cómo Dios quiere que viva?","Here are some questions to get your discussion started.":"Aquí hay algunas preguntas para comenzar su discusión.","Read more":"Leer más","Would you like to discover for yourself what God is like and how God want you to live?":"¿Te gustaría descubrir por ti mismo cómo es Dios y cómo Dios quiere que vivas?","Most people like to make these discoveries in a group with their friends.":"A la mayoría de la gente le gusta hacer estos descubrimientos en un grupo con sus amigos.","Read more\r":"Leer más\r"}