{"Look Back":"Wo ẹhin","Look Up":"Wa","Look Forward":"Mo nreti lati ri","What are you thankful for this week?":"Kini o ṣeun fun ọsẹ yii?","What are you struggling with and how can we help?":"Kini o tiraka pẹlu ati bawo ni a ṣe le ṣe iranlọwọ?","How did you put into practice the scripture\/story we studied last time we met?":"Bawo ni o ṣe fi sinu adaṣe \/ itan ti a kẹkọ igba ti o pade?","Who did you share last week's lesson with and how did it go?":"Tani o pin ẹkọ ti o ni ọsẹ to kọja pẹlu ati bawo ni o ṣe lọ?","What needs did you meet in the community last week?":"Awọn iwulo wo ni o pade ni agbegbe ni ọsẹ to kọja?","Ask someone to read the passage one paragraph at a time.":"Beere lọwọ ẹnikan lati ka aye kan ti ìpínrọ kan ni akoko kan.","Have a group member tell it in their own words.":"Ni ọmọ ẹgbẹ ẹgbẹ kan sọ fun rẹ ninu awọn ọrọ tirẹ.","Ask the group if they added anything or left anything out.":"Beere ẹgbẹ ti wọn ba ṣafikun ohunkohun tabi fi ohunkohun silẹ.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Nigbati o ba pari pẹlu gbogbo awọn ìpínrọ, beere ẹnikan ninu ẹgbẹ lati sọ gbogbo itan nipasẹ iranti. Ni ẹgbẹ naa ṣe atunṣe awọn aṣiṣe eyikeyi.","What does this passage tell us about God?":"Kini aaye yii sọ fun wa nipa Ọlọrun?","What does this passage tell us about people?":"Kini aaye yii sọ fun wa nipa eniyan?","If this passage is true, what behaviour should we change this week?":"Ti o ba jẹ pe ọrọ yii jẹ otitọ, ihuwasi wo ni o yẹ ki a yipada ni ọsẹ yii?","Who will you tell this story to this week?":"Tani iwọ yoo sọ itan yii si ọsẹ yii?","What needs can we meet in the community this week?":"Awọn ibeere wo ni a le pade ni agbegbe ni ọsẹ yii?","When do you want to meet again?":"Nigbawo ni o fẹ lati pade lẹẹkansi?","Discovry Bible Study":"Ikẹkọ Bibeli Bibeli","Discus with Friends":"Disiki pẹlu awọn ọrẹ","Would you like to discover with your friends what God is like and how God want you to live?":"Ṣe iwọ yoo fẹ lati ṣe iwari pẹlu awọn ọrẹ rẹ ohun ti Ọlọrun jẹ bi ati bi Ọlọrun ṣe fẹ ki o gbe?","Here are some questions to get your discussion started.":"Eyi ni diẹ ninu awọn ibeere lati gba ijiroro rẹ bẹrẹ.","Read more":"Ka siwaju","Would you like to discover for yourself what God is like and how God want you to live?":"Ṣe iwọ yoo fẹ lati ṣe awari ararẹ ni ohun ti Ọlọrun jẹ ati bi Ọlọrun ṣe fẹ ki o gbe?","Most people like to make these discoveries in a group with their friends.":"Ọpọlọpọ eniyan fẹran lati ṣe awọn awari wọnyi ni ẹgbẹ kan pẹlu awọn ọrẹ wọn.","Read more\r":"Ka siwaju\r"}