{"Look Back":"Podívej se zpátky","Look Up":"Vzhlédnout","Look Forward":"Těšit se","What are you thankful for this week?":"Co jsi vděčný za tento týden?","What are you struggling with and how can we help?":"S čím bojujete a jak můžeme pomoci?","How did you put into practice the scripture\/story we studied last time we met?":"Jak jste uvedli do praxe Písmo\/příběh, který jsme studovali naposledy, když jsme se setkali?","Who did you share last week's lesson with and how did it go?":"S kým jste se podělili o lekci minulého týdne a jak to šlo?","What needs did you meet in the community last week?":"Jaké potřeby jste se setkali v komunitě minulý týden?","Ask someone to read the passage one paragraph at a time.":"Požádejte někoho, aby si přečetl pasáž jeden odstavec najednou.","Have a group member tell it in their own words.":"Nechte člena skupiny, aby to řekl svými vlastními slovy.","Ask the group if they added anything or left anything out.":"Zeptejte se skupiny, jestli něco přidali nebo něco nechali.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Když skončíte se všemi odstavci, požádejte někoho ve skupině, aby vyprávěl celý příběh podle paměti. Nechte skupinu opravit jakékoli chyby.","What does this passage tell us about God?":"Co nám tato pasáž říká o Bohu?","What does this passage tell us about people?":"Co nám tato pasáž říká o lidech?","If this passage is true, what behaviour should we change this week?":"Pokud je tato pasáž pravdivá, jaké chování bychom měli tento týden změnit?","Who will you tell this story to this week?":"Koho vyprávíte tento příběh do tohoto týdne?","What needs can we meet in the community this week?":"Jaké potřeby se můžeme tento týden setkat v komunitě?","When do you want to meet again?":"Kdy se chcete znovu setkat?","Discovry Bible Study":"Discry Bible Study","Discus with Friends":"Discus s přáteli","Would you like to discover with your friends what God is like and how God want you to live?":"Chtěli byste se svými přáteli objevit, jaký je Bůh a jak chce Bůh žít?","Here are some questions to get your discussion started.":"Zde je několik otázek, jak zahájit vaši diskusi.","Read more":"Přečtěte si více","Would you like to discover for yourself what God is like and how God want you to live?":"Chtěli byste si pro sebe zjistit, jaký je Bůh a jak Bůh chce, abyste žili?","Most people like to make these discoveries in a group with their friends.":"Většina lidí ráda tyto objevy ve skupině se svými přáteli dělá.","Read more\r":"Přečtěte si více\r"}