{"Look Back":"Olhe para trás","Look Up":"Olho para cima","Look Forward":"Esperar ansiosamente","What are you thankful for this week?":"O que você está agradecido por esta semana?","What are you struggling with and how can we help?":"Com o que você está lutando e como podemos ajudar?","How did you put into practice the scripture\/story we studied last time we met?":"Como você colocou em prática a Escritura\/História que estudamos da última vez que conhecemos?","Who did you share last week's lesson with and how did it go?":"Com quem você compartilhou a lição da semana passada e como foi?","What needs did you meet in the community last week?":"Que necessidades você atendeu na comunidade na semana passada?","Ask someone to read the passage one paragraph at a time.":"Peça a alguém para ler a passagem um parágrafo de cada vez.","Have a group member tell it in their own words.":"Peça a um membro do grupo que diga em suas próprias palavras.","Ask the group if they added anything or left anything out.":"Pergunte ao grupo se eles adicionaram alguma coisa ou deixaram alguma coisa de fora.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Quando terminar com todos os parágrafos, peça a alguém do grupo que conte a história toda por memória. Peça ao grupo corrigir quaisquer erros.","What does this passage tell us about God?":"O que essa passagem nos diz sobre Deus?","What does this passage tell us about people?":"O que essa passagem nos diz sobre as pessoas?","If this passage is true, what behaviour should we change this week?":"Se essa passagem for verdadeira, que comportamento devemos mudar esta semana?","Who will you tell this story to this week?":"Quem você contará essa história para esta semana?","What needs can we meet in the community this week?":"Que necessidades podemos atender na comunidade esta semana?","When do you want to meet again?":"Quando você quer se encontrar de novo?","Discovry Bible Study":"Estudo da Bíblia de Discúvia","Discus with Friends":"Disco com amigos","Would you like to discover with your friends what God is like and how God want you to live?":"Você gostaria de descobrir com seus amigos como Deus é e como Deus quer que você viva?","Here are some questions to get your discussion started.":"Aqui estão algumas perguntas para iniciar sua discussão.","Read more":"Consulte Mais informação","Would you like to discover for yourself what God is like and how God want you to live?":"Você gostaria de descobrir por si mesmo como Deus é e como Deus quer que você viva?","Most people like to make these discoveries in a group with their friends.":"A maioria das pessoas gosta de fazer essas descobertas em um grupo com seus amigos.","Read more\r":"Consulte Mais informação\r"}