{"Look Back":"Nhìn lại","Look Up":"Tra cứu","Look Forward":"Mong đợi","What are you thankful for this week?":"Bạn biết ơn điều gì trong tuần này?","What are you struggling with and how can we help?":"Bạn đang vật lộn điều gì và làm thế nào chúng ta có thể giúp đỡ?","How did you put into practice the scripture\/story we studied last time we met?":"Làm thế nào bạn đưa vào thực hành Kinh thánh\/câu chuyện chúng tôi đã nghiên cứu lần trước chúng tôi gặp nhau?","Who did you share last week's lesson with and how did it go?":"Bạn đã chia sẻ bài học tuần trước với ai và nó đã diễn ra như thế nào?","What needs did you meet in the community last week?":"Bạn đã đáp ứng những nhu cầu nào trong cộng đồng tuần trước?","Ask someone to read the passage one paragraph at a time.":"Yêu cầu ai đó đọc đoạn văn một đoạn tại một thời điểm.","Have a group member tell it in their own words.":"Có một thành viên trong nhóm nói với nó bằng lời nói của họ.","Ask the group if they added anything or left anything out.":"Hỏi nhóm nếu họ thêm bất cứ điều gì hoặc bỏ qua bất cứ điều gì.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Khi bạn kết thúc với tất cả các đoạn văn, hãy yêu cầu ai đó trong nhóm kể toàn bộ câu chuyện bằng trí nhớ. Có nhóm sửa bất kỳ lỗi nào.","What does this passage tell us about God?":"Đoạn văn này cho chúng ta biết gì về Chúa?","What does this passage tell us about people?":"Đoạn văn này cho chúng ta biết gì về mọi người?","If this passage is true, what behaviour should we change this week?":"Nếu đoạn văn này là đúng, chúng ta nên thay đổi hành vi nào trong tuần này?","Who will you tell this story to this week?":"Bạn sẽ kể câu chuyện này cho ai trong tuần này?","What needs can we meet in the community this week?":"Những nhu cầu nào chúng ta có thể đáp ứng trong cộng đồng trong tuần này?","When do you want to meet again?":"Khi nào bạn muốn gặp lại nhau?","Discovry Bible Study":"Discovry Kinh Thánh","Discus with Friends":"Cá dĩa với bạn bè","Would you like to discover with your friends what God is like and how God want you to live?":"Bạn có muốn khám phá với bạn bè của bạn như thế nào và Chúa muốn bạn sống như thế nào?","Here are some questions to get your discussion started.":"Dưới đây là một số câu hỏi để bắt đầu cuộc thảo luận của bạn.","Read more":"Đọc thêm","Would you like to discover for yourself what God is like and how God want you to live?":"Bạn có muốn khám phá cho chính mình những gì Chúa là như thế nào và Chúa muốn bạn sống như thế nào?","Most people like to make these discoveries in a group with their friends.":"Hầu hết mọi người thích thực hiện những khám phá này trong một nhóm với bạn bè của họ.","Read more\r":"Đọc thêm\r"}