{"Look Back":"Vaata tagasi","Look Up":"Vaata üles","Look Forward":"Ootan","What are you thankful for this week?":"Mis sa selle nädala eest tänulikud oled?","What are you struggling with and how can we help?":"Millega te vaeva näete ja kuidas saaksime aidata?","How did you put into practice the scripture\/story we studied last time we met?":"Kuidas te praktiseerisite pühakirja\/lugu, mida eelmisel korral uurisime?","Who did you share last week's lesson with and how did it go?":"Kellega jagasite eelmise nädala õppetunni ja kuidas see läks?","What needs did you meet in the community last week?":"Milliseid vajadusi te eelmisel nädalal kogukonnas rahuldasite?","Ask someone to read the passage one paragraph at a time.":"Paluge kellelgi lugeda lõigu üks lõik korraga.","Have a group member tell it in their own words.":"Paluge grupiliigel seda oma sõnadega öelda.","Ask the group if they added anything or left anything out.":"Küsige grupilt, kas nad lisasid midagi või jätsid midagi välja.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kui lõpetate kõigi lõikudega, paluge kellelgi rühmas rääkida kogu lugu mälu järgi. Paluge rühmal kõik vead parandada.","What does this passage tell us about God?":"Mida see lõik meile Jumala kohta räägib?","What does this passage tell us about people?":"Mida see lõik meile inimestest räägib?","If this passage is true, what behaviour should we change this week?":"Kui see lõik on tõsi, siis millist käitumist peaksime sel nädalal muutma?","Who will you tell this story to this week?":"Keda sa selle nädala sellele nädalale räägid?","What needs can we meet in the community this week?":"Milliseid vajadusi saame kogukonnas sel nädalal täita?","When do you want to meet again?":"Millal soovite uuesti kohtuda?","Discovry Bible Study":"Discovry Piibliuuring","Discus with Friends":"Diskussioon sõpradega","Would you like to discover with your friends what God is like and how God want you to live?":"Kas soovite oma sõpradega avastada, milline on Jumal ja kuidas Jumal tahab, et te elaksite?","Here are some questions to get your discussion started.":"Siin on mõned küsimused, et oma arutelu alustada.","Read more":"Loe rohkem","Would you like to discover for yourself what God is like and how God want you to live?":"Kas soovite ise avastada, milline on Jumal ja kuidas Jumal tahab, et te elaksite?","Most people like to make these discoveries in a group with their friends.":"Enamikule inimestele meeldib neid avastusi oma sõpradega rühmas teha.","Read more\r":"Loe rohkem\r"}