{"Look Back":"Yang'anani M'mbuyo","Look Up":"Yang'anani","Look Forward":"Yang'anani kutsogolo","What are you thankful for this week?":"Mukuthokoza bwanji sabata ino?","What are you struggling with and how can we help?":"Mukuvutikira chiyani ndipo tingathandize bwanji?","How did you put into practice the scripture\/story we studied last time we met?":"Kodi mudalemba bwanji lemba \/ nkhani yomwe tidaphunzira nthawi yapitayo tidakumana?","Who did you share last week's lesson with and how did it go?":"Kodi mudagawana chiyani sabata yatha ndipo zidapita bwanji?","What needs did you meet in the community last week?":"Zosowa zomwe mwakumana mdera latha sabata yatha?","Ask someone to read the passage one paragraph at a time.":"Funsani wina kuti awerenge ndime imodzi nthawi.","Have a group member tell it in their own words.":"Khalani ndi gulu la gulu liuzeni m'mawu awoawo.","Ask the group if they added anything or left anything out.":"Funsani gululi ngati awonjezerapo chilichonse kapena kusiya chilichonse.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Mukamaliza ndi ndime zonse, pemphani munthu wina m'gululi kuti afotokozere nkhani yonse. Khalani ndi gulu kuti likonze zolakwika zilizonse.","What does this passage tell us about God?":"Kodi ndimeyi ikutiuza chiyani za Mulungu?","What does this passage tell us about people?":"Kodi ndimeyi ikutiuza chiyani za anthu?","If this passage is true, what behaviour should we change this week?":"Ngati izi ndi zowona, kodi tiyenera kusintha chikhalidwe chiti sabata ino?","Who will you tell this story to this week?":"Kodi mungamudziwe ndani sabata ino?","What needs can we meet in the community this week?":"Kodi ndi zofunikira ziti zomwe tingakumane mdera lanu sabata ino?","When do you want to meet again?":"Mukufuna kudzakumananso liti?","Discovry Bible Study":"Phunziro la Baibulo la Discophry","Discus with Friends":"Discus ndi abwenzi","Would you like to discover with your friends what God is like and how God want you to live?":"Kodi mukufuna kudziwa ndi anzanu zomwe Mulungu amakonda ndi momwe Mulungu amafuna kuti mukhale ndi moyo?","Here are some questions to get your discussion started.":"Nawa mafunso oti zokambirana zanu ziyambike.","Read more":"Werengani zambiri","Would you like to discover for yourself what God is like and how God want you to live?":"Kodi mukufuna kupeza nokha zomwe Mulungu amakonda ndi momwe Mulungu amafuna kuti mukhale moyo?","Most people like to make these discoveries in a group with their friends.":"Anthu ambiri amakonda kupanga zomwe zimapezeka pagulu ndi anzawo.","Read more\r":"Werengani zambiri\r"}