{"Look Back":"Atzera begiratu","Look Up":"Bilatu","Look Forward":"Aurrera begira","What are you thankful for this week?":"Zer eskertzen duzu aste honetan?","What are you struggling with and how can we help?":"Zertan ari zara borrokan eta nola lagun dezakegu?","How did you put into practice the scripture\/story we studied last time we met?":"Nola jarri zenuen ezagutu genuen azken aldian ikasi genuen Eskritura \/ Istorioa?","Who did you share last week's lesson with and how did it go?":"Norekin partekatu zenuen joan den astean ikasgaia eta nola joan zen?","What needs did you meet in the community last week?":"Zer beharrak elkartu zinen joan den astean komunitatean?","Ask someone to read the passage one paragraph at a time.":"Eskatu norbaitek pasarte bat paragrafo bat irakurtzeko aldi berean.","Have a group member tell it in their own words.":"Taldeko kide batek esan bere hitzetan.","Ask the group if they added anything or left anything out.":"Galdetu taldeari ezer gehitu edo ezer utzi izan balute.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Paragrafo guztiekin amaitzen zarenean, galdetu taldeko norbait istorio osoa memoriaz kontatzeko. Taldeak akatsak zuzendu ditu.","What does this passage tell us about God?":"Zer esaten digu pasarte honek Jainkoari buruz?","What does this passage tell us about people?":"Zer esaten digu pasarte honek jendeari buruz?","If this passage is true, what behaviour should we change this week?":"Pasarte hau egia bada, zer portaera aldatu behar dugu aste honetan?","Who will you tell this story to this week?":"Nori esango dio istorio hau aste honetan?","What needs can we meet in the community this week?":"Zer behar dugu Aste honetan komunitatean elkartu gaitezke?","When do you want to meet again?":"Noiz nahi duzu berriro elkartzea?","Discovry Bible Study":"Bibliako azterketa baztertu","Discus with Friends":"Discus lagunekin","Would you like to discover with your friends what God is like and how God want you to live?":"Gustatuko litzaizuke zure lagunekin deskubritzea Jainkoak nolakoa den eta nola bizi nahi duzun Jainkoak?","Here are some questions to get your discussion started.":"Hona hemen zure eztabaida hasteko galdera batzuk.","Read more":"Irakurri gehiago","Would you like to discover for yourself what God is like and how God want you to live?":"Gustatuko litzaizuke zeure burua ezagutzea Jainkoa nolakoa den eta nola bizi nahi duzun Jainkoak?","Most people like to make these discoveries in a group with their friends.":"Jende gehienak nahi ditu aurkikuntza horiek talde batean lagunekin egitea.","Read more\r":"Irakurri gehiago\r"}