{"Look Back":"వెనుకకి చూడు","Look Up":"పైకి చూడు","Look Forward":"ఎదురుచూడండి","What are you thankful for this week?":"ఈ వారానికి మీరు ఏమి కృతజ్ఞతలు?","What are you struggling with and how can we help?":"మీరు దేనితో పోరాడుతున్నారు మరియు మేము ఎలా సహాయం చేయవచ్చు?","How did you put into practice the scripture\/story we studied last time we met?":"మేము కలుసుకున్న చివరిసారి మేము అధ్యయనం చేసిన గ్రంథం\/కథను మీరు ఎలా ఆచరణలో పెట్టారు?","Who did you share last week's lesson with and how did it go?":"గత వారం పాఠాన్ని మీరు ఎవరితో పంచుకున్నారు మరియు అది ఎలా జరిగింది?","What needs did you meet in the community last week?":"గత వారం మీరు సమాజంలో ఏ అవసరాలను తీర్చారు?","Ask someone to read the passage one paragraph at a time.":"ఒక సమయంలో పాసేజ్ వన్ పేరా చదవమని ఒకరిని అడగండి.","Have a group member tell it in their own words.":"ఒక సమూహ సభ్యుడు వారి మాటల్లోనే చెప్పండి.","Ask the group if they added anything or left anything out.":"వారు ఏదైనా జోడించారా లేదా ఏదైనా వదిలివేయారా అని సమూహాన్ని అడగండి.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"మీరు అన్ని పేరాలతో పూర్తి చేసినప్పుడు, గుంపులోని ఒకరిని మొత్తం కథను జ్ఞాపకశక్తి ద్వారా చెప్పమని అడగండి. సమూహం ఏవైనా లోపాలను సరిచేయండి.","What does this passage tell us about God?":"ఈ ప్రకరణం దేవుని గురించి మనకు ఏమి చెబుతుంది?","What does this passage tell us about people?":"ఈ ప్రకరణం ప్రజల గురించి మాకు ఏమి చెబుతుంది?","If this passage is true, what behaviour should we change this week?":"ఈ ప్రకరణం నిజమైతే, ఈ వారం మనం ఏ ప్రవర్తనను మార్చాలి?","Who will you tell this story to this week?":"ఈ వారానికి మీరు ఈ కథను ఎవరు చెబుతారు?","What needs can we meet in the community this week?":"ఈ వారం సమాజంలో మనం ఏ అవసరాలను తీర్చగలం?","When do you want to meet again?":"మీరు ఎప్పుడు మళ్ళీ కలవాలనుకుంటున్నారు?","Discovry Bible Study":"డిస్కోవ్రీ బైబిల్ అధ్యయనం","Discus with Friends":"స్నేహితులతో డిస్కస్","Would you like to discover with your friends what God is like and how God want you to live?":"దేవుడు ఎలా ఉంటాడో మరియు మీరు జీవించాలని దేవుడు ఎలా కోరుకుంటాడు?","Here are some questions to get your discussion started.":"మీ చర్చను ప్రారంభించడానికి ఇక్కడ కొన్ని ప్రశ్నలు ఉన్నాయి.","Read more":"ఇంకా చదవండి","Would you like to discover for yourself what God is like and how God want you to live?":"దేవుడు ఎలా ఉంటాడో మరియు మీరు జీవించాలని దేవుడు ఎలా కోరుకుంటాడు?","Most people like to make these discoveries in a group with their friends.":"చాలా మంది ప్రజలు తమ స్నేహితులతో ఒక సమూహంలో ఈ ఆవిష్కరణలు చేయడానికి ఇష్టపడతారు.","Read more\r":"ఇంకా చదవండి\r"}