{"Look Back":"Respicere post tergum","Look Up":"Respicite","Look Forward":"Exspecto","What are you thankful for this week?":"Quid agis hoc septimana?","What are you struggling with and how can we help?":"Quid tu luctantem et quomodo possumus auxilium?","How did you put into practice the scripture\/story we studied last time we met?":"Quid tu posuit in usu Scripturae \/ fabulamur studuit novissimo tempore conveniremus?","Who did you share last week's lesson with and how did it go?":"Quis tu participes ultima septimana de lectione et quomodo non eam?","What needs did you meet in the community last week?":"Quid opus est in occursum in civitatem ultima septimana?","Ask someone to read the passage one paragraph at a time.":"Petere aliquem legere transitus unum paragraph ad tempus.","Have a group member tell it in their own words.":"Habere coetus membrum dicam in sua verba.","Ask the group if they added anything or left anything out.":"Interrogate coetus si addidit aliquid aut reliquit aliquid ex.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Cum consummare omnes paragraphos, quaeritur aliquem in coetus ad totam fabulam memoriam. Have coetus corrigere aliqua erroribus.","What does this passage tell us about God?":"Quid hic dicam nobis de Deo?","What does this passage tell us about people?":"Quid hoc dicam nobis de populo?","If this passage is true, what behaviour should we change this week?":"Si hoc est verum, quod mores si nos mutare hoc septimana?","Who will you tell this story to this week?":"Quis tu dicis hanc fabulam ad hoc septimana?","What needs can we meet in the community this week?":"Quid necessitates possumus occurrit in civitatem hanc sabbati?","When do you want to meet again?":"Quando vis ad occursum iterum?","Discovry Bible Study":"Disclry Bible Study","Discus with Friends":"Discus cum amicis","Would you like to discover with your friends what God is like and how God want you to live?":"Vis ut reveles cum amicis quae Deus est sicut et quomodo Deus volo vos vivere?","Here are some questions to get your discussion started.":"Hic sunt quaedam quaestiones ut vestri disputationem coepi.","Read more":"Lege plus","Would you like to discover for yourself what God is like and how God want you to live?":"Vis ut reveles enim quod Deus est sicut et quomodo Deus volo vos vivere?","Most people like to make these discoveries in a group with their friends.":"Plurimus populus amo ut haec inventa in coetus cum suis amicis.","Read more\r":"Lege plus\r"}