{"Look Back":"Wspominać","Look Up":"Spojrzeć w górę","Look Forward":"Czekamy","What are you thankful for this week?":"Co jesteś wdzięczny w tym tygodniu?","What are you struggling with and how can we help?":"Z czym walczysz i jak możemy pomóc?","How did you put into practice the scripture\/story we studied last time we met?":"Jak przeprowadziłeś pismo święte\/historię, którą studiowaliśmy ostatnim razem, gdy poznaliśmy?","Who did you share last week's lesson with and how did it go?":"Z kim podzieliłeś się lekcją w zeszłym tygodniu i jak poszło?","What needs did you meet in the community last week?":"Jakie potrzeby spotkałeś w społeczności w zeszłym tygodniu?","Ask someone to read the passage one paragraph at a time.":"Poproś kogoś o przeczytanie pierwszego akapitu na raz.","Have a group member tell it in their own words.":"Niech członek grupy powie to własnymi słowami.","Ask the group if they added anything or left anything out.":"Zapytaj grupę, czy coś dodali, czy coś pominęli.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kiedy skończysz ze wszystkimi akapitami, poproś kogoś z grupy, aby opowiedział całą historię przy pamięci. Niech grupa poprawia wszelkie błędy.","What does this passage tell us about God?":"Co ten fragment mówi nam o Bogu?","What does this passage tell us about people?":"Co ten fragment mówi nam o ludziach?","If this passage is true, what behaviour should we change this week?":"Jeśli ten fragment jest prawdą, jakie zachowanie powinniśmy zmienić w tym tygodniu?","Who will you tell this story to this week?":"Kogo opowiesz tę historię w tym tygodniu?","What needs can we meet in the community this week?":"Jakie potrzeby możemy zaspokoić w społeczności w tym tygodniu?","When do you want to meet again?":"Kiedy chcesz się ponownie spotkać?","Discovry Bible Study":"Badanie biblijne Odkryj","Discus with Friends":"Dysk z przyjaciółmi","Would you like to discover with your friends what God is like and how God want you to live?":"Czy chciałbyś odkryć ze swoimi przyjaciółmi, jaki jest Bóg i jak Bóg chce, żebyś żył?","Here are some questions to get your discussion started.":"Oto kilka pytań do rozpoczęcia dyskusji.","Read more":"Czytaj więcej","Would you like to discover for yourself what God is like and how God want you to live?":"Czy chciałbyś odkryć, jaki jest Bóg i jak Bóg chce, abyś żył?","Most people like to make these discoveries in a group with their friends.":"Większość ludzi lubi dokonywać tych odkryć w grupie z przyjaciółmi.","Read more\r":"Czytaj więcej\r"}