{"Look Back":"Katso taakse","Look Up":"Katso ylös","Look Forward":"Katso eteenpäin","What are you thankful for this week?":"Mitä olet kiitollinen tästä viikosta?","What are you struggling with and how can we help?":"Mitä kamppailet ja miten voimme auttaa?","How did you put into practice the scripture\/story we studied last time we met?":"Kuinka otit käytännössä pyhiä kirjoituksia\/tarinaa, jota tutkimme viime kerralla?","Who did you share last week's lesson with and how did it go?":"Kenen kanssa jaoit viime viikon oppitunnin ja miten se meni?","What needs did you meet in the community last week?":"Mitä tarpeita tapasit yhteisössä viime viikolla?","Ask someone to read the passage one paragraph at a time.":"Pyydä jotakuta lukemaan kohta yksi kappale kerrallaan.","Have a group member tell it in their own words.":"Pyydä ryhmän jäsentä kertomaan sen omien sanojensa mukaan.","Ask the group if they added anything or left anything out.":"Kysy ryhmästä, lisäsivätkö he jotain vai jättivätkö kaikki pois.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Kun lopetat kaikki kappaleet, pyydä jotakuta ryhmästä kertomaan koko tarina muistilla. Pyydä ryhmä korjaamaan kaikki virheet.","What does this passage tell us about God?":"Mitä tämä kohta kertoo meille Jumalasta?","What does this passage tell us about people?":"Mitä tämä kohta kertoo meille ihmisistä?","If this passage is true, what behaviour should we change this week?":"Jos tämä kohta on totta, mitä käyttäytymistä meidän pitäisi muuttaa tällä viikolla?","Who will you tell this story to this week?":"Kenelle kerrot tämän tarinan tällä viikolla?","What needs can we meet in the community this week?":"Mitä tarpeita voimme tyydyttää yhteisössä tällä viikolla?","When do you want to meet again?":"Milloin haluat tavata uudelleen?","Discovry Bible Study":"Diskovry Raamatuntutkimus","Discus with Friends":"Keskustelu ystävien kanssa","Would you like to discover with your friends what God is like and how God want you to live?":"Haluatko löytää ystävien kanssa, millainen Jumala on ja kuinka Jumala haluaa sinun elävän?","Here are some questions to get your discussion started.":"Tässä on joitain kysymyksiä, jotta keskustelu aloitetaan.","Read more":"Lue lisää","Would you like to discover for yourself what God is like and how God want you to live?":"Haluatko löytää itse, millainen Jumala on ja kuinka Jumala haluaa sinun elävän?","Most people like to make these discoveries in a group with their friends.":"Useimmat ihmiset haluavat tehdä nämä löytöt ryhmässä ystäviensä kanssa.","Read more\r":"Lue lisää\r"}