{"Look Back":"Nānā hoʻihoʻi","Look Up":"Nānā i lune","Look Forward":"Nānā i mua","What are you thankful for this week?":"He aha kāu mahalo no kēia pule?","What are you struggling with and how can we help?":"He aha kāu e hakakā nei me ka pehea e hiki ai iā mākou ke kōkua?","How did you put into practice the scripture\/story we studied last time we met?":"Peheaʻoe i kau ai i ka hoʻomaʻamaʻaʻana i ka palapala hemolele \/ moʻolelo mākou i aʻo ai i ka manawa hope a mākou i hālāwai ai?","Who did you share last week's lesson with and how did it go?":"ʻO wai ka mea āu i kaʻana aku i ka haʻawina o ka hebedoma i hala a pehea e hele ai?","What needs did you meet in the community last week?":"He aha nā mea āu i hālāwai ai ma ke kaiāulu i ka pule i hala?","Ask someone to read the passage one paragraph at a time.":"E noi i kekahi e heluhelu i ka pauku i hoʻokahi paukū i ka manawa.","Have a group member tell it in their own words.":"E haʻi i kahi lālā o ka hui i kā lākou mau'ōlelo pono'ī.","Ask the group if they added anything or left anything out.":"E noi i ka hui inā hoʻohui lākou i kekahi mea a haʻalele paha i kekahi mea.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Ke hoʻopauʻoe me nā paukū āpau, e noi aku i kekahi i ka hui e haʻi i ka moʻolelo a pau e hoʻomanaʻo. E hoʻoponopono i ka hui i nā hewa.","What does this passage tell us about God?":"He aha keʻano o kēia pauku e haʻi mai ai iā mākou e pili ana i ke Akua?","What does this passage tell us about people?":"He aha kēia'ōlelo e haʻi ai iā mākou e pili ana i nā kānaka?","If this passage is true, what behaviour should we change this week?":"Inā heʻoiaʻiʻo kēia pauku, he aha ka hana e hoʻololi ai i kēia pule?","Who will you tell this story to this week?":"ʻO waiʻoe e haʻi i kēia moʻolelo i kēia pule?","What needs can we meet in the community this week?":"He aha nā pono e hiki ai iā mākou ke hālāwai me ke kaiāulu i kēia pule?","When do you want to meet again?":"I ka manawa hea e makemake ai e hui hou?","Discovry Bible Study":"Hōʻike Kūlana Kūʻai","Discus with Friends":"Hōʻike me nā hoaaloha","Would you like to discover with your friends what God is like and how God want you to live?":"Makemakeʻoe eʻike me kāu mau hoaaloha he aha ke Akua e like me ke Akua e makemake ai e ola?","Here are some questions to get your discussion started.":"Eia kekahi mau nīnau e hoʻomaka ai i kāu kūkāʻana.","Read more":"Heluhelu hou aku","Would you like to discover for yourself what God is like and how God want you to live?":"Makemakeʻoe eʻike noʻoe iho he aha ke Akua e like me ke Akua e makemake ai e ola?","Most people like to make these discoveries in a group with their friends.":"ʻO ka hapa nui o nā poʻe e makemake e hana i kēia mauʻike i kahi hui me kā lākou mau hoaaloha.","Read more\r":"Heluhelu hou aku\r"}