{"Look Back":"Оглядываться","Look Up":"Искать","Look Forward":"Ожидать","What are you thankful for this week?":"Что вы благодарны на эту неделю?","What are you struggling with and how can we help?":"С чем вы боретесь и чем мы можем помочь?","How did you put into practice the scripture\/story we studied last time we met?":"Как вы применили на практике Священные Писания\/История, которую мы изучали в прошлый раз, когда мы встречались?","Who did you share last week's lesson with and how did it go?":"С кем вы поделились уроком на прошлой неделе и как это произошло?","What needs did you meet in the community last week?":"С какими потребностями вы удовлетворяли в сообществе на прошлой неделе?","Ask someone to read the passage one paragraph at a time.":"Попросите кого -нибудь прочитать отрывок по одному абзацу за раз.","Have a group member tell it in their own words.":"Попросите члена группы сказать это своими словами.","Ask the group if they added anything or left anything out.":"Спросите группу, добавили ли они что -нибудь или что -нибудь оставили.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Когда вы закончите со всеми абзацами, попросите кого -нибудь из группы рассказать всю историю по памяти. Попросите группу исправить любые ошибки.","What does this passage tell us about God?":"Что этот отрывок рассказывает нам о Боге?","What does this passage tell us about people?":"Что этот отрывок рассказывает нам о людях?","If this passage is true, what behaviour should we change this week?":"Если этот отрывок правда, какое поведение мы должны изменить на этой неделе?","Who will you tell this story to this week?":"Кому вы рассказать эту историю на эту неделю?","What needs can we meet in the community this week?":"С какими потребностями мы можем удовлетворить в сообществе на этой неделе?","When do you want to meet again?":"Когда вы хотите встретиться снова?","Discovry Bible Study":"Discovry изучение Библии","Discus with Friends":"Диск с друзьями","Would you like to discover with your friends what God is like and how God want you to live?":"Хотели бы вы узнать со своими друзьями, на что похож Бог и как Бог хочет, чтобы вы жили?","Here are some questions to get your discussion started.":"Вот несколько вопросов, чтобы начать обсуждение.","Read more":"Читать далее","Would you like to discover for yourself what God is like and how God want you to live?":"Хотели бы вы узнать сами, на что похож Бог и как Бог хочет, чтобы вы жили?","Most people like to make these discoveries in a group with their friends.":"Большинству людей нравится делать эти открытия в группе со своими друзьями.","Read more\r":"Читать далее\r"}