{"Look Back":"Angalia nyuma","Look Up":"Tafuta; Tazama juu","Look Forward":"Tarajia mbele","What are you thankful for this week?":"Je! Unashukuru nini kwa wiki hii?","What are you struggling with and how can we help?":"Je! Unapambana na nini na tunawezaje kusaidia?","How did you put into practice the scripture\/story we studied last time we met?":"Je! Ulitumiaje maandiko\/hadithi ambayo tulisoma mara ya mwisho tulipokutana?","Who did you share last week's lesson with and how did it go?":"Je! Ulishiriki somo la wiki iliyopita na iliendaje?","What needs did you meet in the community last week?":"Je! Umekidhi mahitaji gani katika jamii wiki iliyopita?","Ask someone to read the passage one paragraph at a time.":"Uliza mtu asome kifungu kimoja kwa wakati mmoja.","Have a group member tell it in their own words.":"Kuwa na mwanachama wa kikundi aambie kwa maneno yao wenyewe.","Ask the group if they added anything or left anything out.":"Uliza kikundi ikiwa wameongeza chochote au kuacha chochote nje.","When you finish with ALL paragraphs, ask someone in the group to tell the WHOLE story by memory. Have the group correct any errors.":"Unapomaliza na aya zote, muulize mtu kwenye kikundi aambie hadithi nzima kwa kumbukumbu. Acha kikundi kirekebishe makosa yoyote.","What does this passage tell us about God?":"Je! Kifungu hiki kinatuambia nini juu ya Mungu?","What does this passage tell us about people?":"Je! Kifungu hiki kinatuambia nini juu ya watu?","If this passage is true, what behaviour should we change this week?":"Ikiwa kifungu hiki ni kweli, ni tabia gani tunapaswa kubadilisha wiki hii?","Who will you tell this story to this week?":"Utasema nani hadithi hii kwa wiki hii?","What needs can we meet in the community this week?":"Je! Tunaweza kukidhi nini katika jamii wiki hii?","When do you want to meet again?":"Unataka kukutana lini tena?","Discovry Bible Study":"Utafiti wa Bibilia ya Discovry","Discus with Friends":"Discus na marafiki","Would you like to discover with your friends what God is like and how God want you to live?":"Je! Ungependa kugundua na marafiki wako jinsi Mungu alivyo na jinsi Mungu anataka uishi?","Here are some questions to get your discussion started.":"Hapa kuna maswali kadhaa ya kuanza majadiliano yako.","Read more":"Soma zaidi","Would you like to discover for yourself what God is like and how God want you to live?":"Je! Ungependa kugundua mwenyewe Mungu ni jinsi gani na jinsi Mungu anataka uishi?","Most people like to make these discoveries in a group with their friends.":"Watu wengi wanapenda kufanya uvumbuzi huu katika kikundi na marafiki wao.","Read more\r":"Soma zaidi\r"}